# Getting started with Pandas
Introduction to Pandas' most useful and most frequently used classes and functions. Based on [Python Data Science Handbook](https://jakevdp.github.io/PythonDataScienceHandbook/) by Jake VanderPlas.<br>
Another recommended set of good learning resources is [this one](https://qr.ae/pNsm5Y).

## Import packages

In [4]:
import numpy as np
import pandas as pd
%run "import_packages.ipynb"

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

### Package versions

In [5]:
np.__version__
pd.__version__

'1.4.4'

In [6]:
print(np.__version__)
print(pd.__version__)
display(np.__version__)
display(pd.__version__)

1.23.2
1.4.4

'1.23.2'

'1.4.4'

## *pd.Series* objects

In [7]:
s = pd.Series([1.2, -0.45, 2.345, 0])
s

0    1.200
1   -0.450
2    2.345
3    0.000
dtype: float64

### Accessing elements of *pd.Series* objects

In [8]:
s[1]

-0.45

In [9]:
s[2] = 24
# print(s)
# print(s[:3])
display(s)
display(s[:3])

0     1.20
1    -0.45
2    24.00
3     0.00
dtype: float64

0     1.20
1    -0.45
2    24.00
dtype: float64

### *values* and *index* attributes

In [10]:
# print(s.values)
# print(s.index)
# print(type(s.values))
# print(type(s.index))
display(s.values)
display(s.index)
display(type(s.values))
display(type(s.index))

array([ 1.2 , -0.45, 24.  ,  0.  ])

RangeIndex(start=0, stop=4, step=1)

numpy.ndarray

pandas.core.indexes.range.RangeIndex

### *pd.Series* objects as generalized NumPy arrays
The essential difference is the presence of the index: while each NumPy array has an *implicitly* defined *integer* index used to access the values, each `pd.Series` object has an *explicitly* defined index associated with the values.

In [11]:
a = np.array([1.2, -0.45, 2.345, 0])
s = pd.Series([1.2, -0.45, 2.345, 0])
# print(a)
# print(s)
display(a)
display(s)
s

array([ 1.2  , -0.45 ,  2.345,  0.   ])

0    1.200
1   -0.450
2    2.345
3    0.000
dtype: float64

0    1.200
1   -0.450
2    2.345
3    0.000
dtype: float64

In [14]:
s = pd.Series([1.2, -0.45, 2.345, 0], index = [1, 13, 2, 4])
display(s)
s[13]

1     1.200
13   -0.450
2     2.345
4     0.000
dtype: float64

-0.45

In [15]:
s = pd.Series([1.2, -0.45, 2.345, 0], index = ['a', 'b', 'c', 'd'])
display(s)
s['d'] = 23
display(s['d'])
display(s[2])

a    1.200
b   -0.450
c    2.345
d    0.000
dtype: float64

23.0

2.345

### *pd.Series* objects as specialized dictionaries

In [16]:
bands = {'The Beatles': 1962,
         'The Rolling Stones': 1963,
         'Jefferson Airplane': 1965}
bands_s = pd.Series(bands)
display(bands_s)
display(bands_s['The Beatles'])
display(bands_s[0])
display(bands_s['The Beatles':'The Rolling Stones'])      # includes the last index
display(bands_s[0:1])                                     # does not include the last index

The Beatles           1962
The Rolling Stones    1963
Jefferson Airplane    1965
dtype: int64

1962

1962

The Beatles           1962
The Rolling Stones    1963
dtype: int64

The Beatles    1962
dtype: int64

In [20]:
bands = ['The Beatles', 
         'The Rolling Stones']
years = [1962, 1963]
# bands_s = pd.Series(years, index=bands)
# display(bands_s)

# years = [1962, 1963, 1964, 1965]                      # error: there must be as many values as the index implies
# bands_s = pd.Series(years, index=bands)

bands_s = pd.Series({'The Beatles': 1962,
                     'The Rolling Stones': 1963,
                     'Jefferson Airplane': 1965}, 
                    index=bands)                        # the index can be explicitly set if a different result is preferred
display(bands_s)

The Beatles           1962
The Rolling Stones    1963
dtype: int64

##  *pd.DataFrame* objects

In [21]:
indices = ['s1', 's2', 's3']
titles = ['A Day in the Life', 'Because', 'Blackbird']
album_debuts = ['Sgt. Pepper\'s Lonely Hearts Club Band', 'Abbey Road', 'The Beatles']

s_titles = pd.Series(titles, index=indices)
s_album_debuts = pd.Series(album_debuts, index=indices)

songs = pd.DataFrame({'Title':s_titles, 'Album debut':s_album_debuts})
display(songs)
songs

# songs = pd.DataFrame(s_titles, columns=['Title'])     # create a single-column pd.DataFrame object from a pd.Series object
# display(songs)

# pd.DataFrame(np.random.rand(3, 2),                    # create a pd.DataFrame object from a 2-dimensional NumPy array
#              columns=['foo', 'bar'],
#              index=['a', 'b', 'c'])

                Title                            Album debut
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band
s2            Because                             Abbey Road
s3          Blackbird                            The Beatles

                Title                            Album debut
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band
s2            Because                             Abbey Road
s3          Blackbird                            The Beatles

### *index* and *columns* attributes

In [22]:
display(songs.index)
display(type(songs.index))

display(songs.columns)
display(type(songs.columns))

Index(['s1', 's2', 's3'], dtype='object')

pandas.core.indexes.base.Index

Index(['Title', 'Album debut'], dtype='object')

pandas.core.indexes.base.Index

### *dtype* and *dtypes* attributes

In [23]:
display(songs.Title.dtype)                    # 'O' (object)
display(songs['Album debut'].dtype)           # 'O' (object)
display(songs.dtypes)

dtype('O')

dtype('O')

Title          object
Album debut    object
dtype: object

### *pd.DataFrame* objects as specialized dictionaries (or as "arrays of arrays (columns)")

In [24]:
display(songs['Title'])                       # a pd.DataFrame is a generalized dictionary (or "an array of arrays (columns)"); 
display(type(songs['Title']))                 # each value-element of that dictionary (array) is a pd.Series object (a column)

s1    A Day in the Life
s2              Because
s3            Blackbird
Name: Title, dtype: object

pandas.core.series.Series

In [26]:
e = pd.DataFrame()                          # create an empty df
display(e)
display(e.columns)
display(e.index)

e['Title'] = s_titles                       # add new column (new element to the corresponding dictionary)
display(e)

Empty DataFrame
Columns: []
Index: []

Index([], dtype='object')

Index([], dtype='object')

                Title
s1  A Day in the Life
s2            Because
s3          Blackbird

## *pd.Index* objects

In [27]:
i = pd.Index([5, 3, 7, 9, 1])
i

Int64Index([5, 3, 7, 9, 1], dtype='int64')

In [28]:
display(i[1])

# i[1] = 4                                  # no! pd.Index objects are immutable

3

In [31]:
songs_index = songs.index
# display('songs_index:', songs_index)      # in this case, the output looks better with print()
# display('songs_index attributes:', songs_index.shape, songs_index.size, songs_index.ndim, songs_index.dtype)
print('songs_index:', songs_index)
print('songs_index attributes:', songs_index.shape, songs_index.size, songs_index.ndim, songs_index.dtype)

songs_index: Index(['s1', 's2', 's3'], dtype='object')
songs_index attributes: (3,) 3 1 object

## Data selection in *pd.Series* objects

The patterns of data indexing and selection in `pd.Series` objects rely on the fact that, in many ways, `pd.Serias` objects act like standard Python dictionaries, and in many ways like a one-dimensional NumPy arrays.

### *pd.Series* object as Python dictionary

In [34]:
# titles = pd.Series(data=['A Day in the Life', 'I Feel Fine', 'Let It Be', 'One After 9:09'],
#                    index=['s1', 's2', 's3', 's4'])
titles = pd.Series(['A Day in the Life', 'I Feel Fine', 'Let It Be', 'One After 9:09'],
                   index=['s1', 's2', 's3', 's4'])
display(titles)

s1    A Day in the Life
s2          I Feel Fine
s3            Let It Be
s4       One After 9:09
dtype: object

In [37]:
display(titles['s2'])
titles['s5'] = 'Oh, Darling'
display(titles)

display(titles.keys())
display(titles.keys)
# display(titles.values())                   # error! 'numpy.ndarray' object is not callable
display(titles.values)
display(titles.items())
display(titles.items)

'I Feel Fine'

s1    A Day in the Life
s2          I Feel Fine
s3            Let It Be
s4       One After 9:09
s5          Oh, Darling
dtype: object

Index(['s1', 's2', 's3', 's4', 's5'], dtype='object')

<bound method Series.keys of s1    A Day in the Life
s2          I Feel Fine
s3            Let It Be
s4       One After 9:09
s5          Oh, Darling
dtype: object>

array(['A Day in the Life', 'I Feel Fine', 'Let It Be', 'One After 9:09',
       'Oh, Darling'], dtype=object)

<bound method Series.items of s1    A Day in the Life
s2          I Feel Fine
s3            Let It Be
s4       One After 9:09
s5          Oh, Darling
dtype: object>

### *pd.Series* object as one-dimensional array

In [38]:
# slicing
display(titles['s2':'s4'])
display(titles[0:2])

# fancy indexing
display(titles[['s5', 's1']])
display(titles[[0, 2]])

# masking
times = pd.Series([300, 160, 210, 123, 150],
                  index=['a', 'b', 'c', 'd', 'e'])
display(times[times > 150])

# print the titles that start with 'O'
display(titles.values[i] for i in range(titles.size))
display(list(titles.values[i] for i in range(titles.size) if titles.values[i].startswith('O')))

s2       I Feel Fine
s3         Let It Be
s4    One After 9:09
dtype: object

s1    A Day in the Life
s2          I Feel Fine
dtype: object

s5          Oh, Darling
s1    A Day in the Life
dtype: object

s1    A Day in the Life
s3            Let It Be
dtype: object

a    300
b    160
c    210
dtype: int64

['One After 9:09', 'Oh, Darling']

### *loc* and *iloc* indexers
`loc` refers to explicit `pd.Series` object indices. `iloc` refers to implicit Python-style indices.

In [39]:
titles = pd.Series(['A Day in the Life', 'I Feel Fine', 'Let It Be', 'One After 9:09'], 
                   index=[3, 8, 2, 4])
display(titles)

# explicit indexing
display(titles.loc[[8, 2]])
display(titles.loc[8:4])

# implicit indexing
display(titles.iloc[[3, 2]])
display(titles.iloc[1:4])

3    A Day in the Life
8          I Feel Fine
2            Let It Be
4       One After 9:09
dtype: object

8    I Feel Fine
2      Let It Be
dtype: object

8       I Feel Fine
2         Let It Be
4    One After 9:09
dtype: object

4    One After 9:09
2         Let It Be
dtype: object

8       I Feel Fine
2         Let It Be
4    One After 9:09
dtype: object

## Data selection in *pd.DataFrame* objects

Create a simple `pd.DataFrame` objects with a couple of The Beatles songs:

In [40]:
indices = ['s1', 's2', 's3']
titles = ['A Day in the Life', 'Because', 'Blackbird']
album_debuts = ['Sgt. Pepper\'s Lonely Hearts Club Band', 'Abbey Road', 'The Beatles']

s_titles = pd.Series(titles, index=indices)
s_album_debuts = pd.Series(album_debuts, index=indices)

songs = pd.DataFrame({'Title':s_titles, 'Album debut':s_album_debuts})
# print(songs)
songs

                Title                            Album debut
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band
s2            Because                             Abbey Road
s3          Blackbird                            The Beatles

### *pd.DataFrame* object as Python dictionary

Access specific columns in two equivalent ways:

In [41]:
display(songs['Title'])
display(songs.Title)

s1    A Day in the Life
s2              Because
s3            Blackbird
Name: Title, dtype: object

s1    A Day in the Life
s2              Because
s3            Blackbird
Name: Title, dtype: object

Add new column:

In [42]:
songs['Time'] = pd.Series([300, 200, 111, ], index=indices)
# songs['Time'] = [300, 200, 111, ]                             # works as well
# songs['Time'] = pd.Series([300, 200, 111, ])                  # adds NaNs, because the indices don't match
# display(songs.Time.dtype)                                     # int64

songs

                Title                            Album debut  Time
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band   300
s2            Because                             Abbey Road   200
s3          Blackbird                            The Beatles   111

#### *rename()*
Rename a specific column. Based on [this](https://stackoverflow.com/questions/19758364/rename-specific-columns-in-pandas).

In [43]:
songs.rename(columns={'Time':'Length'}, inplace=True)
display(songs)

songs.rename(columns={'Length':'Time'}, inplace=True)           # bring back the previous name, for later processing

                Title                            Album debut  Length
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band     300
s2            Because                             Abbey Road     200
s3          Blackbird                            The Beatles     111

### *pd.DataFrame* as two-dimensional array

Transpose a `pd.DataFrame` object:

In [44]:
songs.T

                                                s1          s2           s3
Title                            A Day in the Life     Because    Blackbird
Album debut  Sgt. Pepper's Lonely Hearts Club Band  Abbey Road  The Beatles
Time                                           300         200          111

Access single rows/columns:

In [45]:
display(songs.loc['s2'])                  # access a row
display(type(songs.loc['s2']))            # a pd.Series object

display(songs['Title'])                   # access a column
display(type(songs['Title']))             # a pd.Series object

Title             Because
Album debut    Abbey Road
Time                  200
Name: s2, dtype: object

pandas.core.series.Series

s1    A Day in the Life
s2              Because
s3            Blackbird
Name: Title, dtype: object

pandas.core.series.Series

Slicing a `pd.DataFrame` object:

In [46]:
display(songs.loc['s2':'s3', 'Title':'Album debut'])
display(songs.iloc[:2, :2])

        Title  Album debut
s2    Because   Abbey Road
s3  Blackbird  The Beatles

                Title                            Album debut
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band
s2            Because                             Abbey Road

Slicing and masking refer to *rows* when using only one index, not to columns:

In [47]:
display(songs['s2':'s3'])
display(songs[1:3])

display(songs[songs.Time > 150])

        Title  Album debut  Time
s2    Because   Abbey Road   200
s3  Blackbird  The Beatles   111

        Title  Album debut  Time
s2    Because   Abbey Road   200
s3  Blackbird  The Beatles   111

                Title                            Album debut  Time
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band   300
s2            Because                             Abbey Road   200

Fancy indexing a `pd.DataFrame` object:

In [48]:
songs.loc[['s1', 's3']]

                Title                            Album debut  Time
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band   300
s3          Blackbird                            The Beatles   111

Combined indexing:

In [49]:
songs.loc[['s1', 's3'], 'Title':'Album debut']

                Title                            Album debut
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band
s3          Blackbird                            The Beatles

**<u>Make sure</u>** to see [this](https://stackoverflow.com/questions/17071871/how-to-select-rows-from-a-dataframe-based-on-column-values) for *many* other different and useful functions and examples of selecting rows based on column values.

## Ufuncs with *pd.Series* and *pd.DataFrame* objects

The following table lists Python operators and their equivalent Pandas object methods (ufuncs):

| Python Operator | Pandas Method(s)                      |
|-----------------|---------------------------------------|
| ``+``           | ``add()``                             |
| ``-``           | ``sub()``, ``subtract()``             |
| ``*``           | ``mul()``, ``multiply()``             |
| ``/``           | ``truediv()``, ``div()``, ``divide()``|
| ``//``          | ``floordiv()``                        |
| ``%``           | ``mod()``                             |
| ``**``          | ``pow()``                             |

If the data is clean and the dimensions match each other, everything works as intuitively expected. Otherwise, `NaN` or `inf` values are inserted as the values of some elements/cells where Pandas cannot insert another value.

### Ufuncs with *pd.Series* objects

In [50]:
# The 'name' argument allows for giving a name to a pd.Series object, i.e. to a column. When the pd.Series object is put in a pd.DataFrame, the column will be named according to the 'name' parameter.
song_counts_1 = pd.Series({'1963': 3, '1964': 4, '1965': 5, '1966': 6}, name='early')
song_counts_2 = pd.Series({'1963': 23, '1964': 34, '1965': 33, '1966': 18}, name='early')
song_counts_3 = pd.Series({'1965': 3, '1966': 5, '1967': 17, '1968': 20, '1969': 21, '1970': 12}, name='late')

display(song_counts_1 + song_counts_2)
display(song_counts_2 + song_counts_3)
display(song_counts_2.add(song_counts_3, fill_value=0))          # use fill_value wherever the real value is missing

1963    26
1964    38
1965    38
1966    24
Name: early, dtype: int64

1963     NaN
1964     NaN
1965    36.0
1966    23.0
1967     NaN
1968     NaN
1969     NaN
1970     NaN
dtype: float64

1963    23.0
1964    34.0
1965    36.0
1966    23.0
1967    17.0
1968    20.0
1969    21.0
1970    12.0
dtype: float64

### Ufuncs with *pd.DataFrame* objects

In [54]:
rng = np.random.RandomState(42)
S1 = pd.DataFrame(rng.randint(10, 20, (2, 2)), 
                  columns=['count 1', 'count 2'])
S1

   count 1  count 2
0       16       13
1       17       14

In [55]:
S2 = pd.DataFrame(rng.randint(10, 20, (3, 3)), 
                  columns=['count 3', 'count 2', 'count 1'])          # indices deliberately disaligned w.r.t. S1
S2

   count 3  count 2  count 1
0       16       19       12
1       16       17       14
2       13       17       17

In [56]:
S1 + S2                                                               # indices aligned in the result

   count 1  count 2  count 3
0     28.0     32.0      NaN
1     31.0     31.0      NaN
2      NaN      NaN      NaN

In [57]:
fill = S1.stack().mean()                                              # stack(): convert df into equivalent multi-index Series
S1.add(S2, fill_value=fill)                                           # mean(): calculate mean of ALL elements in that series

   count 1  count 2  count 3
0     28.0     32.0     31.0
1     31.0     31.0     31.0
2     32.0     32.0     28.0

### Ufuncs between *pd.DataFrame* and *pd.Series* objects

In [58]:
S2 - S2.iloc[1]                                                       # effectively, row-wise broadcasting

   count 3  count 2  count 1
0        0        2       -2
1        0        0        0
2       -3        0        3

In [59]:
S2.subtract(S2['count 3'], axis=0)

   count 3  count 2  count 1
0        0        3       -4
1        0        1       -2
2        0        4        4

## Missing values

### *np.nan*
`np.nan`, `.np.nansum()`, `np.nanmin()`, `np.nanmax()`, `np.nanmean()`, `np.nanmedian()`,...

`np.nan` represents NAs (and is slightly different from `None`). `.np.nansum()`, `np.nanmin()`, `np.nanmax()`, `np.nanmean()`, `np.nanmedian()`,... make their respective calculations ignoring NAs.

In [183]:
v = np.array([2, np.nan, 3, 5])
display(v[1])
display(1 + v[1])
print(v.sum(), v.max())
print(np.nansum(v), np.nanmax(v), np.nanmin(v), np.nanmean(v), np.nanmedian(v))

nan

nan

nan nan
10.0 5.0 2.0 3.3333333333333335 3.0

### *isnull()* and *notnull()*
Detect `None` and NA in `pd.Series` and `pd.DataFrame` objects and create the appropriate masks.

In [60]:
indices = ['s1', 's2', 's3', 's4']
titles = ['A Day in the Life', None, 'Blackbird', np.nan]
album_debuts = ['Sgt. Pepper\'s Lonely Hearts Club Band', 'Abbey Road', 'The Beatles', np.nan]

s_titles = pd.Series(titles, index=indices)
s_album_debuts = pd.Series(album_debuts, index=indices)

songs = pd.DataFrame({'Title':s_titles, 'Album debut':s_album_debuts})
# display(songs)
songs

                Title                            Album debut
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band
s2               None                             Abbey Road
s3          Blackbird                            The Beatles
s4                NaN                                    NaN

In [66]:
display(s_titles.isnull())
display(s_titles.notnull)
display(s_titles.notnull())
display(songs.notnull())
display(s_titles[s_titles.notnull()])

s1    A Day in the Life
s3            Blackbird
dtype: object

### *dropna()*
For a `pd.Series` object, drops all NA values.

In [67]:
display(s_titles)
display(s_titles.dropna())

s1    A Day in the Life
s2                 None
s3            Blackbird
s4                  NaN
dtype: object

s1    A Day in the Life
s3            Blackbird
dtype: object

For a `pd.DataFrame` object, no dropping individual NA values, just the entire rows/columns containing such values:

In [68]:
songs = pd.DataFrame({'Title':s_titles, 'Album debut':s_album_debuts})
display(songs)
display(songs.dropna())                          # drop all rows in which ANY null value is present
display(songs.dropna(axis='rows'))               # drop all rows in which ANY null value is present (axis='rows' is the default)
display(songs.dropna(axis='columns'))            # drop all columns in which ANY null value is present
songs['Album debut']['s4'] = 'Rubber Soul'
display(songs.dropna(axis='columns'))            # drop all columns in which ANY null value is present

songs = pd.DataFrame({'Title':s_titles, 'Album debut':s_album_debuts})
display(songs)
display(songs.dropna(how='all'))                 # drop only the rows in which ALL values are null (default is how='any')
display(songs.dropna(axis='columns', thresh=3))  # drop the columns with thresh or more NON-null values

                Title                            Album debut
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band
s2               None                             Abbey Road
s3          Blackbird                            The Beatles
s4                NaN                                    NaN

                Title                            Album debut
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band
s3          Blackbird                            The Beatles

                Title                            Album debut
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band
s3          Blackbird                            The Beatles

Empty DataFrame
Columns: []
Index: [s1, s2, s3, s4]

                              Album debut
s1  Sgt. Pepper's Lonely Hearts Club Band
s2                             Abbey Road
s3                            The Beatles
s4                            Rubber Soul

                Title                            Album debut
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band
s2               None                             Abbey Road
s3          Blackbird                            The Beatles
s4                NaN                                    NaN

                Title                            Album debut
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band
s2               None                             Abbey Road
s3          Blackbird                            The Beatles

                              Album debut
s1  Sgt. Pepper's Lonely Hearts Club Band
s2                             Abbey Road
s3                            The Beatles
s4                                    NaN

### *fillna()*
For a `pd.Series` object, drops all NA values.

In [69]:
display(s_titles)
display(s_titles.fillna('Let It Be'))

s1    A Day in the Life
s2                 None
s3            Blackbird
s4                  NaN
dtype: object

s1    A Day in the Life
s2            Let It Be
s3            Blackbird
s4            Let It Be
dtype: object

Forward-fill or backward-fill each NA value with the previous one:

In [70]:
indices = ['s1', 's2', 's3', 's4']
titles = ['A Day in the Life', None, 'Blackbird', np.nan]
album_debuts = ['Sgt. Pepper\'s Lonely Hearts Club Band', 'Abbey Road', 'The Beatles', np.nan]

s_titles = pd.Series(titles, index=indices)
s_album_debuts = pd.Series(album_debuts, index=indices)

songs = pd.DataFrame({'Title':s_titles, 'Album debut':s_album_debuts})
display(songs)

display(s_titles)
display(s_titles.fillna(method='ffill'))                          # forward-fill
display(s_titles.fillna(method='bfill'))                          # backward-fill

display(songs.fillna(method='ffill'))
display(songs.fillna(method='ffill', axis=0))                     # axis=0 (default): fill along the columns
display(songs.fillna(method='bfill', axis=1))                     # axis=1: fill along the rows

                Title                            Album debut
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band
s2               None                             Abbey Road
s3          Blackbird                            The Beatles
s4                NaN                                    NaN

s1    A Day in the Life
s2                 None
s3            Blackbird
s4                  NaN
dtype: object

s1    A Day in the Life
s2    A Day in the Life
s3            Blackbird
s4            Blackbird
dtype: object

s1    A Day in the Life
s2            Blackbird
s3            Blackbird
s4                  NaN
dtype: object

                Title                            Album debut
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band
s2  A Day in the Life                             Abbey Road
s3          Blackbird                            The Beatles
s4          Blackbird                            The Beatles

                Title                            Album debut
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band
s2  A Day in the Life                             Abbey Road
s3          Blackbird                            The Beatles
s4          Blackbird                            The Beatles

                Title                            Album debut
s1  A Day in the Life  Sgt. Pepper's Lonely Hearts Club Band
s2         Abbey Road                             Abbey Road
s3          Blackbird                            The Beatles
s4                NaN                                    NaN

## Hierarchical indexing (Multi-indexing)
Using more than one key in indices. The point is that *each extra level in a multi-index represents an extra dimension of data*. In other words, one can convert a multi-indexed `pd.Series` object to a `pd.DataFrame` object (using the `pd.Series.unstack()` method) in which each column directly corresponds to a key in the multi-index of the original `pd.Series` object.

### Using Python tuples as keys
This is the bad way and is not recommended. Still, it illustrates the idea and is an intro to the real multi-indexing.

In [71]:
indices = [(1963, 'Please, Please Me'),
           (1963, 'With The Beatles'),
           (1964, 'A Hard Day\'s Night'),
           (1964, 'The Beatles for Sale'),
           (1964, 'The Beatles for Sale')]
s = pd.Series(['I Saw Her Standing There', 
               'Till There Was You', 
               'Things We Said Today', 
               'Baby\'s In Black',
               'No Reply'], 
              index=indices)
s

(1963, Please, Please Me)       I Saw Her Standing There
(1963, With The Beatles)              Till There Was You
(1964, A Hard Day's Night)          Things We Said Today
(1964, The Beatles for Sale)             Baby's In Black
(1964, The Beatles for Sale)                    No Reply
dtype: object

Selecting only the songs from, e.g., 1964 (in a general case, i.e. when they are not pre-ordered) looks clumsy:

In [72]:
s[[i for i in s.index if i[0] == 1964]]

(1964, A Hard Day's Night)      Things We Said Today
(1964, The Beatles for Sale)         Baby's In Black
(1964, The Beatles for Sale)                No Reply
(1964, The Beatles for Sale)         Baby's In Black
(1964, The Beatles for Sale)                No Reply
dtype: object

### *pd.MultiIndex*
This is the recommended way to do multi-indexing.

#### *from_tuples()* and *reindex()*

In [73]:
indices = pd.MultiIndex.from_tuples([(1963, 'Please, Please Me'),
                                     (1963, 'With The Beatles'),
                                     (1964, 'A Hard Day\'s Night'),
                                     (1964, 'The Beatles for Sale'),
                                     (1964, 'The Beatles for Sale')])
indices.names = ['Year', 'Album']

# #  Alternatively:
# indices = pd.MultiIndex.from_tuples([(1963, 'Please, Please Me'),
#                                      (1963, 'With The Beatles'),
#                                      (1964, 'A Hard Day\'s Night'),
#                                      (1964, 'The Beatles for Sale'),
#                                      (1964, 'The Beatles for Sale')],
#                                    names=['Year', 'Album'])                # without it the index levels remain unlabeled

s = s.reindex(indices)
s

Year  Album
1963  Please, Please Me       I Saw Her Standing There
      With The Beatles              Till There Was You
1964  A Hard Day's Night          Things We Said Today
      The Beatles for Sale             Baby's In Black
      The Beatles for Sale                    No Reply
dtype: object

Selecting only the songs from, e.g., 1964 (in a general case, i.e. when they are not pre-ordered), as well as selecting only the songs from a specific album (i.e., along the second key in the index) and the like, is now direct:

In [74]:
display(s[1964])
display(s[:, 'The Beatles for Sale'])

Album
A Hard Day's Night      Things We Said Today
The Beatles for Sale         Baby's In Black
The Beatles for Sale                No Reply
dtype: object

Year
1964    Baby's In Black
1964           No Reply
dtype: object

#### *stack()* and *unstack()*
Converting between multi-indexed `pd.Series` and the equivalent `pd.DataFrame` objects. Once again, remember that *each extra level in a multi-index represents an extra dimension of data*. <br>**HOWEVER**, each key combination in the relevant `pd.MultiIndex` object must be *unique* in order for `unstack()` to work!

In [75]:
s_df = s.unstack(s)                # with the non-unique indices as set above, this produces a ValueError

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

Create a multi-indexed `pd.Series` object where all key combinations in the multi-index are unique, and `unstack()` it to a `pd.DataFrame` object:

In [76]:
indices = pd.MultiIndex.from_tuples([(1963, 'Please, Please Me'),
                                     (1963, 'With The Beatles'),
                                     (1964, 'A Hard Day\'s Night'),
                                     (1964, 'The Beatles for Sale')], 
                                   names=['Year', 'Album'])
s = pd.Series(['I Saw Her Standing There', 
               'Till There Was You', 
               'Things We Said Today', 
               'No Reply'],
              index=indices)
s_df = s.unstack()
s_df

Album,A Hard Day's Night,"Please, Please Me",The Beatles for Sale,With The Beatles
Year,,,,
1963,NaN,I Saw Her Standing There,NaN,Till There Was You
1964,Things We Said Today,NaN,No Reply,NaN

In [77]:
s_df.stack()

Year  Album
1963  Please, Please Me       I Saw Her Standing There
      With The Beatles              Till There Was You
1964  A Hard Day's Night          Things We Said Today
      The Beatles for Sale                    No Reply
dtype: object

#### Explicit *pd.MultiIndex* constructors
`from_arrays()`, `from_tuples()`, `from_product()`

Provide flexibility in creating `pd.MultiIndex` objects. A `pd.MultiIndex` object created in any of these ways can be passed as the ``index`` argument when creating a `pd.Series` or a `pd.Dataframe` object, or be passed to the `reindex()` method of an existing `pd.Series` or `pd.Dataframe` object.

In [78]:
indices = pd.MultiIndex.from_tuples([(1963, 'Please, Please Me'),
                                     (1963, 'With The Beatles'),
                                     (1964, 'A Hard Day\'s Night'),
                                     (1964, 'The Beatles for Sale')])
display(indices)

indices = pd.MultiIndex.from_arrays([[1963, 1963, 1964, 1964], 
                                     ['Please, Please Me', 'With The Beatles', 'A Hard Day\'s Night', 'The Beatles for Sale']])
display(indices)

indices = pd.MultiIndex.from_product([[1963, 1964], 
                                      ['album', 'single']])                # Cartesian product
display(indices)

MultiIndex([(1963,    'Please, Please Me'),
            (1963,     'With The Beatles'),
            (1964,   'A Hard Day's Night'),
            (1964, 'The Beatles for Sale')],
           )

MultiIndex([(1963,    'Please, Please Me'),
            (1963,     'With The Beatles'),
            (1964,   'A Hard Day's Night'),
            (1964, 'The Beatles for Sale')],
           )

MultiIndex([(1963,  'album'),
            (1963, 'single'),
            (1964,  'album'),
            (1964, 'single')],
           )

#### Using *levels* and *codes*
An alternative to using `from_product()`.

In [79]:
indices = pd.MultiIndex(levels=[[1963, 1964], ['album', 'single']], 
                        codes=[[0, 0, 1, 1], [0, 1, 0, 1]])
display(indices)

print(indices[0], '\n', indices[1])

display(indices[1][1])

MultiIndex([(1963,  'album'),
            (1963, 'single'),
            (1964,  'album'),
            (1964, 'single')],
           )

(1963, 'album')
 (1963, 'single')

'single'

#### Multiindexing *pd.DataFrame* columns
Just as the rows can have multiple levels of indices, the columns can have multiple levels as well.

In [80]:
indices = pd.MultiIndex.from_product([[1963, 1964], 
                                      ['album', 'single']])                # Cartesian product
columns = pd.MultiIndex.from_product([['No.1', 'No.2'], 
                                      ['UK', 'US']])
# titles = np.array(['1', '2', '3', '4']).reshape(2, 2)                    # just testing
titles = np.array(['No Reply',
                   'I\'m A Loser',
                   'Baby\'s In Black',
                   'Rock And Roll Music',
                   'I\'ll Follow The Sun',
                   'Mr Moonlight',
                   'Kansas City/Hey-Hey-Hey-Hey!',
                   'Eight Days A Week',
                   'Words Of Love',
                   'Honey Don\'t',
                   'Every Little Thing',
                   'I Don\'t Want To Spoil The Party',
                   'What You\'re Doing',
                   'Everybody\'s Trying To Be My Baby',
                   'Please, Please Me',
                   'Anna']).reshape(4, 4)
# display(titles)
np.random.shuffle(titles.flat)                                              # shuffle the songs to mimic randomness
s = pd.DataFrame(titles, index=indices, columns=columns)
s

C:\Users\Vladan\AppData\Local\Temp\ipykernel_33028\1054621489.py:23: UserWarning: you are shuffling a 'flatiter' object which is not a subclass of 'Sequence'; `shuffle` is not guaranteed to behave correctly. E.g., non-numpy array/tensor objects with view semantics may contain duplicates after shuffling.
  np.random.shuffle(titles.flat)                                              # shuffle the songs to mimic randomness

                                        No.1                       \
                                          UK                   US
1963 album                              Anna    What You're Doing
     single     Kansas City/Hey-Hey-Hey-Hey!  I'll Follow The Sun
1964 album               Rock And Roll Music          Honey Don't
     single  I Don't Want To Spoil The Party        Words Of Love

                                         No.2
                                           UK                  US
1963 album                           No Reply         I'm A Loser
     single  Everybody's Trying To Be My Baby  Every Little Thing
1964 album                    Baby's In Black        Mr Moonlight
     single                 Eight Days A Week   Please, Please Me

And now some indexing and slicing (but remember that **the first index refers to columns!!!**):

In [81]:
display(s['No.1'])
display(s['No.1']['UK'])
display(s['No.1'][0:2])
display(s['No.1']['UK'][1963])
display(s['No.1']['UK'][1963, 'single'])

                                          UK                   US
1963 album                              Anna    What You're Doing
     single     Kansas City/Hey-Hey-Hey-Hey!  I'll Follow The Sun
1964 album               Rock And Roll Music          Honey Don't
     single  I Don't Want To Spoil The Party        Words Of Love

1963  album                                Anna
      single       Kansas City/Hey-Hey-Hey-Hey!
1964  album                 Rock And Roll Music
      single    I Don't Want To Spoil The Party
Name: UK, dtype: object

                                       UK                   US
1963 album                           Anna    What You're Doing
     single  Kansas City/Hey-Hey-Hey-Hey!  I'll Follow The Sun

album                             Anna
single    Kansas City/Hey-Hey-Hey-Hey!
Name: UK, dtype: object

'Kansas City/Hey-Hey-Hey-Hey!'

#### *sort_index()*

In [82]:
indices = pd.MultiIndex.from_tuples([(1964, 'A Hard Day\'s Night'),               # unsorted multi-index
                                     (1964, 'The Beatles for Sale'), 
                                     (1963, 'Please, Please Me'),
                                     (1963, 'With The Beatles')],
                                   names=['Year', 'Album'])
s = pd.Series(['Things We Said Today', 
               'No Reply', 
               'I Saw Her Standing There', 
               'Till There Was You'],
              index=indices)
display(s)

display(s[1964])

# display(s.loc[1964:1963])                                                         # produces UnsortedIndexError

s = s.sort_index()
display(s.loc[1963:1964])                                                           # after sorting the index, it works

Year  Album
1964  A Hard Day's Night          Things We Said Today
      The Beatles for Sale                    No Reply
1963  Please, Please Me       I Saw Her Standing There
      With The Beatles              Till There Was You
dtype: object

Album
A Hard Day's Night      Things We Said Today
The Beatles for Sale                No Reply
dtype: object

Year  Album
1963  Please, Please Me       I Saw Her Standing There
      With The Beatles              Till There Was You
1964  A Hard Day's Night          Things We Said Today
      The Beatles for Sale                    No Reply
dtype: object

#### *unstack()* and *stack()*
For `unstack()`, specifying the `level` tells Pandas which index level to represent as columns.

In [83]:
# s_df = s.unstack()
# s_df = s.unstack(level=1)                # same as s.unstack()
s_df = s.unstack(level=0)
s_df

Year                                      1963                  1964
Album
A Hard Day's Night                         NaN  Things We Said Today
Please, Please Me     I Saw Her Standing There                   NaN
The Beatles for Sale                       NaN              No Reply
With The Beatles            Till There Was You                   NaN

In [84]:
s_df.stack()

Album                 Year
A Hard Day's Night    1964        Things We Said Today
Please, Please Me     1963    I Saw Her Standing There
The Beatles for Sale  1964                    No Reply
With The Beatles      1963          Till There Was You
dtype: object

#### *reset_index()* and *set_index()*

In [88]:
indices = pd.MultiIndex.from_tuples([(1964, 'A Hard Day\'s Night'),               # unsorted multi-index
                                     (1964, 'The Beatles for Sale'),
                                     (1963, 'Please, Please Me'),
                                     (1963, 'With The Beatles')],
                                    names=['Year', 'Album'])
s = pd.Series(['Things We Said Today',
               'No Reply',
               'I Saw Her Standing There',
               'Till There Was You'],
              index=indices)
display(s)

s.reset_index()
# display(type(s.reset_index()))              # pd.DataFrame

Year  Album
1964  A Hard Day's Night          Things We Said Today
      The Beatles for Sale                    No Reply
1963  Please, Please Me       I Saw Her Standing There
      With The Beatles              Till There Was You
dtype: object

   Year                 Album                         0
0  1964    A Hard Day's Night      Things We Said Today
1  1964  The Beatles for Sale                  No Reply
2  1963     Please, Please Me  I Saw Her Standing There
3  1963      With The Beatles        Till There Was You

In [89]:
s.reset_index(name='song')

   Year                 Album                      song
0  1964    A Hard Day's Night      Things We Said Today
1  1964  The Beatles for Sale                  No Reply
2  1963     Please, Please Me  I Saw Her Standing There
3  1963      With The Beatles        Till There Was You

In [90]:
s_flat = s.reset_index(name='song')
display(s_flat)
display(type(s_flat))

s_flat.set_index(['Year', 'Album'])
# s_flat.set_index(['Album', 'Year'])
# display(type(s_flat.set_index(['Album', 'Year'])))              # pd.DataFrame

   Year                 Album                      song
0  1964    A Hard Day's Night      Things We Said Today
1  1964  The Beatles for Sale                  No Reply
2  1963     Please, Please Me  I Saw Her Standing There
3  1963      With The Beatles        Till There Was You

pandas.core.frame.DataFrame

                                               song
Year Album
1964 A Hard Day's Night        Things We Said Today
     The Beatles for Sale                  No Reply
1963 Please, Please Me     I Saw Her Standing There
     With The Beatles            Till There Was You

### Data aggregations on multi-indices
For hierarchically indexed data, data aggregation methods (`mean()`, `sum()`, `max()`,...) can be passed a `level` parameter that controls which subset of the data the aggregate is computed on.

Prepare some data:

In [91]:
indices = pd.MultiIndex.from_tuples([(1967, 'Sgt. Pepper'),
                                     (1969, 'Abbey Road'),
                                     (1969, 'Abbey Road'), 
                                     (1967, 'Sgt. Pepper')], 
                                    names=['Year', 'Album'])

titles = ['A Day in the Life', 'Because', 'Golden Slumbers', 'Lovely Rita']
lengths = [300, 200, 100, 150]
releases = [50, 5, 30, 8]

s_titles = pd.Series(titles, index=indices)
s_lengths = pd.Series(lengths, index=indices)
s_releases = pd.Series(releases, index=indices)

songs = pd.DataFrame({'Title':s_titles, 'Length':s_lengths, 'Releases':s_releases},
                     index=indices)
display(songs)

songs = songs.sort_index()
songs

                              Title  Length  Releases
Year Album
1967 Sgt. Pepper  A Day in the Life     300        50
1969 Abbey Road             Because     200         5
     Abbey Road     Golden Slumbers     100        30
1967 Sgt. Pepper        Lovely Rita     150         8

                              Title  Length  Releases
Year Album
1967 Sgt. Pepper  A Day in the Life     300        50
     Sgt. Pepper        Lovely Rita     150         8
1969 Abbey Road             Because     200         5
     Abbey Road     Golden Slumbers     100        30

Run some aggregation operations on the data (use `drop()` to leave out some columns from the data frame if necessary; use `to_numeric()` or `astype()` to convert the type of columns in the resulting dataframe, if needed (see [this](https://stackoverflow.com/a/28648923) for details)):

In [92]:
# Compute mean song lengths and song releases by year
# means_by_year = songs.drop(columns='Title')                           # just testing
means_by_year = songs.drop(columns='Title').mean(level='Year')
# means_by_year['Length'] = \
#   pd.to_numeric(round(means_by_year['Length']), downcast='integer')   # converts float output to int; round() is desirable
# means_by_year['Releases'] = \
#   pd.to_numeric(round(means_by_year['Releases']), downcast='integer') # converts float output to int; round() is desirable
# means_by_year = means_by_year.round().astype(int)                     # converts all columns to int; round() is desirable
means_by_year = \
  means_by_year[['Length', 'Releases']].round().astype(int)             # converts selected columns to int; round() is desirable
means_by_year

C:\Users\Vladan\AppData\Local\Temp\ipykernel_33028\1167750802.py:3: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  means_by_year = songs.drop(columns='Title').mean(level='Year')

      Length  Releases
Year
1967     225        29
1969     150        18

In [93]:
# Compute max song lengths and song releases by album
max_by_album = songs.drop(columns='Title').max(level='Album')
max_by_album

C:\Users\Vladan\AppData\Local\Temp\ipykernel_33028\2404931486.py:2: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  max_by_album = songs.drop(columns='Title').max(level='Album')

             Length  Releases
Album
Sgt. Pepper     300        50
Abbey Road      200        30

In [94]:
# Compute overall min values
min_overall = songs.drop(columns='Title').min()
min_overall

Length      100
Releases      5
dtype: int64

## Combining datasets: *pd.concat()* and *pd.append()*
Concatenating `pd.Series` and `pd.DataFrame` objects.

### *pd.concat()*
Accepts lists and tuples as arguments.

#### Row-wise concatenation
Default concatenation is row-wise.

In [211]:
titles = ['A Day in the Life', 'Can\'t Buy Me Love', 'Blackbird', 'Taxman']
s1 = pd.Series(titles[0:2])
s2 = pd.Series(titles[-2:])
display(s1)
display(s2)

s = pd.concat([s1, s2])
display(s)

lengths = [300, 150, 120, 160]

s = pd.DataFrame({'Title':titles, 'Length':lengths})
display(s)

ss = pd.concat((s, s))
ss

0    A Day in the Life
1    Can't Buy Me Love
dtype: object

0    Blackbird
1       Taxman
dtype: object

0    A Day in the Life
1    Can't Buy Me Love
0            Blackbird
1               Taxman
dtype: object

               Title  Length
0  A Day in the Life     300
1  Can't Buy Me Love     150
2          Blackbird     120
3             Taxman     160

               Title  Length
0  A Day in the Life     300
1  Can't Buy Me Love     150
2          Blackbird     120
3             Taxman     160
0  A Day in the Life     300
1  Can't Buy Me Love     150
2          Blackbird     120
3             Taxman     160

#### Handling duplicate indices by creating a new index - the `ignore_index` parameter
Duplicate indices can be handled with `ignore_index=True`:

In [212]:
ss = pd.concat((s, s), ignore_index=True)
ss

               Title  Length
0  A Day in the Life     300
1  Can't Buy Me Love     150
2          Blackbird     120
3             Taxman     160
4  A Day in the Life     300
5  Can't Buy Me Love     150
6          Blackbird     120
7             Taxman     160

#### Handling duplicate indices by introducing multi-indices - the `keys` parameter
Alternatively, multi-indices can be created using `keys` to label the data sources:

In [213]:
ss = pd.concat((s, s), keys=(1, 2))
ss

                 Title  Length
1 0  A Day in the Life     300
  1  Can't Buy Me Love     150
  2          Blackbird     120
  3             Taxman     160
2 0  A Day in the Life     300
  1  Can't Buy Me Love     150
  2          Blackbird     120
  3             Taxman     160

#### Column-wise concatenation
To concatenate column-wise, use `axis=1`:

In [214]:
ss = pd.concat([s, s], axis=1)
display(ss)

releases = pd.Series([20, 100, 10, 8], name='No. of releases')
ss = pd.concat([s, releases], axis=1)
ss

# Alternatively, to add the 'No. of releases' column to s:
# s['No. of releases'] = releases
# s

               Title  Length              Title  Length
0  A Day in the Life     300  A Day in the Life     300
1  Can't Buy Me Love     150  Can't Buy Me Love     150
2          Blackbird     120          Blackbird     120
3             Taxman     160             Taxman     160

               Title  Length  No. of releases
0  A Day in the Life     300               20
1  Can't Buy Me Love     150              100
2          Blackbird     120               10
3             Taxman     160                8

#### Concatenation with joins
Happens when the `pd.DataFrame` objects don't have all columns in common. By default, the entries for which no data is available are filled with NA values:

In [215]:
d1 = pd.DataFrame({'Title':pd.Series(['A Day in the Life', 'Can\'t Buy Me Love']), 
                   'Length':pd.Series([300, 150])})
d2 = pd.DataFrame({'Title':pd.Series(['Blackbird', 'Taxman'])})
s = pd.concat([d1, d2])
s

               Title  Length
0  A Day in the Life   300.0
1  Can't Buy Me Love   150.0
0          Blackbird     NaN
1             Taxman     NaN

By default, the join is a union of the input columns (`join='outer'`), but we can change this to an intersection of the columns using `join='inner'`:

In [216]:
s = pd.concat([d1, d2], join='inner')
s

               Title
0  A Day in the Life
1  Can't Buy Me Love
0          Blackbird
1             Taxman

To specify the columns to be used in the join, use `reindex()`. For example, to reindex `s2` to match `s1` columns, or vice versa:

In [217]:
d1['No. of releases'] = pd.Series([20, 100])
d2['No. of releases'] = pd.Series([10, 8])
display(d1)
display(d2)

# s = pd.concat([d1, d2.reindex(d1.columns, axis=1)])
s = pd.concat([d1.reindex(d2.columns, axis=1), d2])
s

               Title  Length  No. of releases
0  A Day in the Life     300               20
1  Can't Buy Me Love     150              100

       Title  No. of releases
0  Blackbird               10
1     Taxman                8

               Title  No. of releases
0  A Day in the Life               20
1  Can't Buy Me Love              100
0          Blackbird               10
1             Taxman                8

### *append()*
Works much like `pd.concat()`, but appends a `pd.DataFrame` object to another one as a result of running the `append()` method for the other one.

In [218]:
d1.append(d2)

               Title  Length  No. of releases
0  A Day in the Life   300.0               20
1  Can't Buy Me Love   150.0              100
0          Blackbird     NaN               10
1             Taxman     NaN                8

## Combining datasets: `pd.merge()`
Used for various merge and join operations on datasets (on-to-one joins, many-to-one joins, many-to-many joins).

### One-to-one joins
Very similar to the column-wise concatenation with `pd.concat()`. `pd.merge()` recognizes that the `pd.DataFrame` objecs have a common column, and automatically joins using this column as a key. The result of the merge is a new `pd.DataFrame` object that combines the information from the two inputs.<br>
Notice that the order of entries in each column is not necessarily maintained: the order of the key column can differ between the input dataframes, and `pd.merge()` correctly accounts for this.<br>
Additionally, keep in mind that the merge in general discards the index, except in the special case of merges by index (see the `left_index` and `right_index` keywords, discussed momentarily).

In [219]:
d1 = pd.DataFrame({'Title':pd.Series(['A Day in the Life', 'Can\'t Buy Me Love', 'Blackbird', 'Taxman']), 
                   'Length':pd.Series([300, 150, 120, 160])})
d2 = pd.DataFrame({'Title':pd.Series(['Blackbird', 'Taxman', 'A Day in the Life', 'Can\'t Buy Me Love']),
                   'No. of releases':[10, 8, 20, 100]})
display(d1)
display(d2)
s = pd.merge(d1, d2)
s

               Title  Length
0  A Day in the Life     300
1  Can't Buy Me Love     150
2          Blackbird     120
3             Taxman     160

               Title  No. of releases
0          Blackbird               10
1             Taxman                8
2  A Day in the Life               20
3  Can't Buy Me Love              100

               Title  Length  No. of releases
0  A Day in the Life     300               20
1  Can't Buy Me Love     150              100
2          Blackbird     120               10
3             Taxman     160                8

### Many-to-one joins
These are joins in which one of the two key columns contains duplicate entries. For the many-to-one case, the resulting `pd.DataFrame` will preserve those duplicate entries as appropriate. It will also one or more additional columns where the information is repeated in some locations as required by the inputs.

In [220]:
d1 = pd.DataFrame({'Title':pd.Series(['A Day in the Life', 
                                      'Can\'t Buy Me Love', 
                                      'Things We Said Today', 
                                      'Blackbird', 
                                      'Taxman']), 
                   'Album':pd.Series(['Sgt. Pepper', 
                                      'A Hard Day\'s Night', 
                                      'A Hard Day\'s Night', 
                                      'The Beatles',
                                      'Revolver']),
                   'Length':pd.Series([300, 150, 135, 120, 160])})
d2 = pd.DataFrame({'Album':pd.Series(['Sgt. Pepper', 
                                      'A Hard Day\'s Night', 
                                      'The Beatles',
                                      'Revolver']),
                   'Year':[1967, 1963, 1968, 1966], 
                   'Re-issues':[5, 6, 3, 2]})
display(d1)
display(d2)
s = pd.merge(d1, d2)
s

                  Title               Album  Length
0     A Day in the Life         Sgt. Pepper     300
1     Can't Buy Me Love  A Hard Day's Night     150
2  Things We Said Today  A Hard Day's Night     135
3             Blackbird         The Beatles     120
4                Taxman            Revolver     160

                Album  Year  Re-issues
0         Sgt. Pepper  1967          5
1  A Hard Day's Night  1963          6
2         The Beatles  1968          3
3            Revolver  1966          2

                  Title               Album  Length  Year  Re-issues
0     A Day in the Life         Sgt. Pepper     300  1967          5
1     Can't Buy Me Love  A Hard Day's Night     150  1963          6
2  Things We Said Today  A Hard Day's Night     135  1963          6
3             Blackbird         The Beatles     120  1968          3
4                Taxman            Revolver     160  1966          2

### Many-to-many joins
A many-to-many join occurs when the key column in both the left and right array contains duplicates.

In [221]:
d1 = pd.DataFrame({'Title':pd.Series(['A Day in the Life', 
                                      'Can\'t Buy Me Love', 
                                      'Things We Said Today', 
                                      'Blackbird', 
                                      'Taxman', 
                                      'Fixing a Hole']), 
                   'Album':pd.Series(['Sgt. Pepper', 
                                      'A Hard Day\'s Night', 
                                      'A Hard Day\'s Night', 
                                      'The Beatles',
                                      'Revolver', 
                                      'Sgt. Pepper']),
                   'Length':pd.Series([300, 150, 135, 120, 160, 155])})
d2 = pd.DataFrame({'Album':pd.Series(['Sgt. Pepper', 
                                      'Sgt. Pepper', 
                                      'A Hard Day\'s Night', 
                                      'A Hard Day\'s Night', 
                                      'The Beatles',
                                      'The Beatles',
                                      'Revolver',
                                      'Revolver']),
                   'Released / Remastered':[1967, 2017, 1963, 2013, 1968, np.NaN, 1966, np.NaN]}, 
                  dtype=object)   # not necessary, but avoids automatic conversion of int to float in 'Released / Remastered'
display(d1)
display(d2)
s = pd.merge(d1, d2)
s

                  Title               Album  Length
0     A Day in the Life         Sgt. Pepper     300
1     Can't Buy Me Love  A Hard Day's Night     150
2  Things We Said Today  A Hard Day's Night     135
3             Blackbird         The Beatles     120
4                Taxman            Revolver     160
5         Fixing a Hole         Sgt. Pepper     155

                Album Released / Remastered
0         Sgt. Pepper                  1967
1         Sgt. Pepper                  2017
2  A Hard Day's Night                  1963
3  A Hard Day's Night                  2013
4         The Beatles                  1968
5         The Beatles                   NaN
6            Revolver                  1966
7            Revolver                   NaN

                   Title               Album  Length Released / Remastered
0      A Day in the Life         Sgt. Pepper     300                  1967
1      A Day in the Life         Sgt. Pepper     300                  2017
2          Fixing a Hole         Sgt. Pepper     155                  1967
3          Fixing a Hole         Sgt. Pepper     155                  2017
4      Can't Buy Me Love  A Hard Day's Night     150                  1963
5      Can't Buy Me Love  A Hard Day's Night     150                  2013
6   Things We Said Today  A Hard Day's Night     135                  1963
7   Things We Said Today  A Hard Day's Night     135                  2013
8              Blackbird         The Beatles     120                  1968
9              Blackbird         The Beatles     120                   NaN
10                Taxman            Revolver     160                  1966
11                Taxman            Revolver     160                   NaN

### Specification of the merge key
The default behavior of `pd.merge()` is: it looks for one or more matching column names between the two inputs, and uses this as the key.<br>
However, often the column names will not match so nicely. `pd.merge()` provides a variety of options for handling this.

#### The `on` keyword
Most simply, you can explicitly specify the name of the key column using the `on` keyword, which takes a column name or a list of column names. This option works only if both the left and right `pd.DataFrame`s have the specified column name.

In [223]:
d1 = pd.DataFrame({'Title':pd.Series(['A Day in the Life', 'Can\'t Buy Me Love', 'Blackbird', 'Taxman']), 
                   'Length':pd.Series([300, 150, 120, 160])})
d2 = pd.DataFrame({'Title':pd.Series(['Blackbird', 'Taxman', 'A Day in the Life', 'Can\'t Buy Me Love']),
                   'No. of releases':[10, 8, 20, 100]})
display(d1)
display(d2)
s = pd.merge(d1, d2, on='Title')
s

               Title  Length
0  A Day in the Life     300
1  Can't Buy Me Love     150
2          Blackbird     120
3             Taxman     160

               Title  No. of releases
0          Blackbird               10
1             Taxman                8
2  A Day in the Life               20
3  Can't Buy Me Love              100

               Title  Length  No. of releases
0  A Day in the Life     300               20
1  Can't Buy Me Love     150              100
2          Blackbird     120               10
3             Taxman     160                8

#### The `left_on` and `right_on` keywords

If the two datasets to merge have all different column names, use the `left_on` and `right_on` keywords to specify the two column names. <br>
For example, in a songs dataset the song title can be labeled as "Title", and in another dataset as "Song title".

In [225]:
d1 = pd.DataFrame({'Title':pd.Series(['A Day in the Life', 'Can\'t Buy Me Love', 'Blackbird', 'Taxman']), 
                   'Length':pd.Series([300, 150, 120, 160])})
d2 = pd.DataFrame({'Song title':pd.Series(['Blackbird', 'Taxman', 'A Day in the Life', 'Can\'t Buy Me Love']),
                   'No. of releases':[10, 8, 20, 100]})
display(d1)
display(d2)
s = pd.merge(d1, d2, left_on='Title', right_on='Song title')
s

               Title  Length
0  A Day in the Life     300
1  Can't Buy Me Love     150
2          Blackbird     120
3             Taxman     160

          Song title  No. of releases
0          Blackbird               10
1             Taxman                8
2  A Day in the Life               20
3  Can't Buy Me Love              100

               Title  Length         Song title  No. of releases
0  A Day in the Life     300  A Day in the Life               20
1  Can't Buy Me Love     150  Can't Buy Me Love              100
2          Blackbird     120          Blackbird               10
3             Taxman     160             Taxman                8

To eliminate a redundant column, `drop()` comes handy:

In [226]:
s = pd.merge(d1, d2, left_on='Title', right_on='Song title').drop('Song title', axis=1)
s

               Title  Length  No. of releases
0  A Day in the Life     300               20
1  Can't Buy Me Love     150              100
2          Blackbird     120               10
3             Taxman     160                8

#### The `left_index` and `right_index` keywords
Useful for merging on an index, rather than on a column (i.e. for using the index as the key for merging).<br>
Can be combined with `left_on` and `right_on` (although the output in that case may require some extra work).

In [234]:
d1 = pd.DataFrame({'Title':pd.Series(['A Day in the Life', 'Can\'t Buy Me Love', 'Blackbird', 'Taxman']), 
                   'Length':pd.Series([300, 150, 120, 160])})
d2 = pd.DataFrame({'Title':pd.Series(['Blackbird', 'Taxman', 'A Day in the Life', 'Can\'t Buy Me Love']),
                   'No. of releases':[10, 8, 20, 100]})
d1 = d1.set_index('Title')
d2 = d2.set_index('Title')
display(d1)
display(d2)

# s = pd.merge(d1, d2)                     # this won't work now - no common columns to perform the merge on
s = pd.merge(d1, d2, left_index=True, right_index=True)
display(s)

d2 = pd.DataFrame({'Song title':pd.Series(['Blackbird', 'Taxman', 'A Day in the Life', 'Can\'t Buy Me Love']),
                   'No. of releases':[10, 8, 20, 100]})
s = pd.merge(d1, d2, left_index=True, right_on='Song title')
s

                   Length
Title
A Day in the Life     300
Can't Buy Me Love     150
Blackbird             120
Taxman                160

                   No. of releases
Title
Blackbird                       10
Taxman                           8
A Day in the Life               20
Can't Buy Me Love              100

                   Length  No. of releases
Title
A Day in the Life     300               20
Can't Buy Me Love     150              100
Blackbird             120               10
Taxman                160                8

   Length         Song title  No. of releases
2     300  A Day in the Life               20
3     150  Can't Buy Me Love              100
0     120          Blackbird               10
1     160             Taxman                8

#### `join()`
A shorthand for using `pd.merge()` with `left_index=True` and `right_index=True`.

In [237]:
d1 = pd.DataFrame({'Title':pd.Series(['A Day in the Life', 'Can\'t Buy Me Love', 'Blackbird', 'Taxman']), 
                   'Length':pd.Series([300, 150, 120, 160])})
d2 = pd.DataFrame({'Title':pd.Series(['Blackbird', 'Taxman', 'A Day in the Life', 'Can\'t Buy Me Love']),
                   'No. of releases':[10, 8, 20, 100]})
d1 = d1.set_index('Title')
d2 = d2.set_index('Title')
d1.join(d2)

                   Length  No. of releases
Title
A Day in the Life     300               20
Can't Buy Me Love     150              100
Blackbird             120               10
Taxman                160                8

#### The `how` keyword
Important when a value appears in one key column but not the other. Possible values include `'inner'` (intersection; the default), `'outer'` (union), `'left'` and `'right'`.

In [7]:
d1 = pd.DataFrame({'Title':pd.Series(['A Day in the Life', 'Can\'t Buy Me Love', 'Blackbird']), 
                   'Length':pd.Series([300, 150, 120])})
d2 = pd.DataFrame({'Title':pd.Series(['Blackbird', 'Taxman']),
                   'No. of releases':[10, 8]})
display(d1)
display(d2)
display(pd.merge(d1, d2))
display(pd.merge(d1, d2, how='outer'))
display(pd.merge(d1, d2, how='left'))
display(pd.merge(d1, d2, how='right'))

               Title  Length
0  A Day in the Life     300
1  Can't Buy Me Love     150
2          Blackbird     120

       Title  No. of releases
0  Blackbird               10
1     Taxman                8

       Title  Length  No. of releases
0  Blackbird     120               10

               Title  Length  No. of releases
0  A Day in the Life   300.0              NaN
1  Can't Buy Me Love   150.0              NaN
2          Blackbird   120.0             10.0
3             Taxman     NaN              8.0

               Title  Length  No. of releases
0  A Day in the Life     300              NaN
1  Can't Buy Me Love     150              NaN
2          Blackbird     120             10.0

       Title  Length  No. of releases
0  Blackbird   120.0               10
1     Taxman     NaN                8

#### The `suffixes` keyword
Important when one or more columns *other than the key column* have the same (conflicting) names. By default, Pandas will create two columns in the resulting dataframe and will add the `_x` and `_y` suffixes to their names. The `suffixes` keyword enables superseding the defaults.

In [15]:
# d1 = pd.DataFrame({'Title':pd.Series(['A Day in the Life', 'Can\'t Buy Me Love', 'Blackbird', 'Taxman']), 
#                    'Length':pd.Series([300, 150, 120, 160])})
# d2 = pd.DataFrame({'Title':pd.Series(['A Day in the Life', 'Can\'t Buy Me Love', 'Blackbird', 'Taxman']), 
#                    'Length':pd.Series([300, 150, 120, 160])})
d1 = pd.DataFrame({'Title':pd.Series(['A Day in the Life', 'Can\'t Buy Me Love']), 
                   'Length':pd.Series([300, 150])})
d2 = pd.DataFrame({'Title':pd.Series(['Blackbird', 'Taxman']), 
                   'Length':pd.Series([120, 160])})
display(d1)
display(d2)
display(pd.merge(d1, d2, on='Title', how='outer'))
display(pd.merge(d1, d2, on='Title', how='outer', suffixes=['_d1', '_d2']))

               Title  Length
0  A Day in the Life     300
1  Can't Buy Me Love     150

       Title  Length
0  Blackbird     120
1     Taxman     160

               Title  Length_x  Length_y
0  A Day in the Life     300.0       NaN
1  Can't Buy Me Love     150.0       NaN
2          Blackbird       NaN     120.0
3             Taxman       NaN     160.0

               Title  Length_d1  Length_d2
0  A Day in the Life      300.0        NaN
1  Can't Buy Me Love      150.0        NaN
2          Blackbird        NaN      120.0
3             Taxman        NaN      160.0

## Exercises: The Beatles songs dataset

### Exercise 1
Read a dataset and split it in two, column-wise. Keep one or more columns in both resulting datasets.

#### Read the dataset
The dataset used in this exercise does not contain NA values.

In [3]:
songs = pd.read_csv('data/The Beatles songs dataset, v2, no NAs.csv')

#### Display some data from the dataset

In [4]:
# display(songs.head)
display(songs['Title'].head)
display(songs.columns)
display(songs['Lead.vocal'].head)

<bound method NDFrame.head of 0                        12-Bar Original
1                      A Day in the Life
2                     A Hard Day's Night
3             A Shot of Rhythm and Blues
4                       A Taste of Honey
                     ...
305       You're Going to Lose That Girl
306    You've Got to Hide Your Love Away
307       You've Really Got a Hold on Me
308                          Young Blood
309              Your Mother Should Know
Name: Title, Length: 310, dtype: object>

Index(['Title', 'Year', 'Album.debut', 'Duration', 'Other.releases', 'Genre',
       'Songwriter', 'Lead.vocal', 'Top.50.Billboard'],
      dtype='object')

<bound method NDFrame.head of 0                         NaN
1        Lennon and McCartney
2      Lennon, with McCartney
3                      Lennon
4                   McCartney
                ...
305                    Lennon
306                    Lennon
307       Lennon and Harrison
308                  Harrison
309                 McCartney
Name: Lead.vocal, Length: 310, dtype: object>

#### Split the dataset in two by selecting different columns
There are multiple ways to do it. <br>Whatever the way you use, if you also want to rearrange the columns in a dataset, see [this](https://stackoverflow.com/questions/13148429/how-to-change-the-order-of-dataframe-columns).

##### Method 1: using lists of columns

Based on [this](https://stackoverflow.com/a/13148611) idea.<br>
Convert the columns `Index` object from the original dataset to a list of column names and select some columns for the two dataframes.

In [5]:
cols = songs.columns.tolist()
cols

['Title',
 'Year',
 'Album.debut',
 'Duration',
 'Other.releases',
 'Genre',
 'Songwriter',
 'Lead.vocal',
 'Top.50.Billboard']

In [6]:
cols1 = cols[0:5]
display(cols1)
# display(cols[0])
# display([cols[0]])
cols2 = [cols[0]] + cols[5:]
display(cols2)

['Title', 'Year', 'Album.debut', 'Duration', 'Other.releases']

['Title', 'Genre', 'Songwriter', 'Lead.vocal', 'Top.50.Billboard']

Create the two dataframes.

In [7]:
songs1 = songs[cols1]
songs2 = songs[cols2]
# display(songs1.head)
# display(songs2.head)

For the sake of the exercise, in the second dataframe deliberately change the name of the `Title` column to `Song title`.

In [8]:
# songs2.rename(columns={'Title':'Song title'}, inplace=True)                 # throws a warning, so working on a copy is better
songs2 = songs2.copy().rename(columns={'Title':'Song title'})

In [9]:
display(songs2.columns)
display(songs2.head)

Index(['Song title', 'Genre', 'Songwriter', 'Lead.vocal', 'Top.50.Billboard'], dtype='object')

<bound method NDFrame.head of                             Song title  \
0                      12-Bar Original
1                    A Day in the Life
2                   A Hard Day's Night
3           A Shot of Rhythm and Blues
4                     A Taste of Honey
..                                 ...
305     You're Going to Lose That Girl
306  You've Got to Hide Your Love Away
307     You've Really Got a Hold on Me
308                        Young Blood
309            Your Mother Should Know

                                                 Genre  \
0                                                Blues
1                 Psychedelic Rock, Art Rock, Pop/Rock
2                           Rock, Electronic, Pop/Rock
3                                        R&B, Pop/Rock
4                         Pop/Rock, Jazz, Stage&Screen
..                                                 ...
305                                     Rock, Pop/Rock
306                                       FolkPop/Rock
307                                     Soul, Pop/Rock
308                                           Pop/Rock
309  Music Hall, Vaudeville Rock, Psychedelic Pop, ...

                                  Songwriter              Lead.vocal  \
0    Lennon, McCartney, Harrison and Starkey                     NaN
1                       Lennon and McCartney    Lennon and McCartney
2                                     Lennon  Lennon, with McCartney
3                                   Thompson                  Lennon
4                              Scott, Marlow               McCartney
..                                       ...                     ...
305                                   Lennon                  Lennon
306                                   Lennon                  Lennon
307                                 Robinson     Lennon and Harrison
308                          Leiber, Stoller                Harrison
309                                McCartney               McCartney

     Top.50.Billboard
0                  -1
1                  -1
2                   8
3                  -1
4                  -1
..                ...
305                -1
306                -1
307                -1
308                -1
309                -1

[310 rows x 5 columns]>

##### Method 2: using `np.split()`
Based on [this idea](https://stackoverflow.com/a/41624305).

Use `np.split()` to split the original dataframe to two or more smaller-width dataframes.

In [10]:
display(songs.columns.tolist())
s = np.split(songs, [5], axis=1)    # [5]: split on the 'Genre' column (the 6th one; it becomes the first one in the second df)
songs1 = s[0]
songs2 = s[1]
# songs1.head
# songs2.head
songs2 = pd.concat([pd.DataFrame({'Song title':songs['Title']}), songs2], axis=1)
# songs2.head
display(songs1.columns.tolist())
display(songs2.columns.tolist())

['Title',
 'Year',
 'Album.debut',
 'Duration',
 'Other.releases',
 'Genre',
 'Songwriter',
 'Lead.vocal',
 'Top.50.Billboard']

['Title', 'Year', 'Album.debut', 'Duration', 'Other.releases']

['Song title', 'Genre', 'Songwriter', 'Lead.vocal', 'Top.50.Billboard']

##### Method 3: using the `loc` and `iloc` indexers
Based on [this idea](https://stackoverflow.com/a/41624272) and on the third example from the [`pd.DataFrame` as two-dimensional array](#pd.DataFrame-as-two-dimensional-array) section (Slicing a `pd.DataFrame` object).

In [11]:
# # Just testing
# songs1 = songs.loc[:, ['Title', 'Year']]
# display(songs1.head)
# songs2 = songs.iloc[:, 5:]    # 5: split on the 'Genre' column (the 6th one; it becomes the first one in the second df)
# display(songs2.head)
# # display(songs.loc['s2':'s3', 'Title':'Album debut'])
# # display(songs.iloc[:2, :2])

songs1 = songs.iloc[:, :5]    # 5: split on the 'Genre' column (the 6th one; it becomes the first one in the second df)
display(songs1.head)
songs2 = songs.loc[:, 'Genre':'Top.50.Billboard']
songs2 = pd.concat([pd.DataFrame({'Song title':songs['Title']}), songs2], axis=1)
display(songs2.head)

<bound method NDFrame.head of                                  Title  Year  \
0                      12-Bar Original  1965
1                    A Day in the Life  1967
2                   A Hard Day's Night  1964
3           A Shot of Rhythm and Blues  1963
4                     A Taste of Honey  1963
..                                 ...   ...
305     You're Going to Lose That Girl  1965
306  You've Got to Hide Your Love Away  1965
307     You've Really Got a Hold on Me  1963
308                        Young Blood  1963
309            Your Mother Should Know  1967

                                           Album.debut  Duration  \
0                                          Anthology 2       174
1                Sgt. Pepper's Lonely Hearts Club Band       335
2                 UK: A Hard Day's Night US: 1962-1966       152
3                                      Live at the BBC       104
4           UK: Please Please Me US: The Early Beatles       163
..                                                 ...       ...
305                                              Help!       140
306                                              Help!       131
307  UK: With the Beatles US: The Beatles Second Album       182
308                                    Live at the BBC       116
309                               Magical Mystery Tour       149

     Other.releases
0                 0
1                12
2                35
3                 0
4                29
..              ...
305               6
306              12
307               2
308               0
309              13

[310 rows x 5 columns]>

<bound method NDFrame.head of                             Song title  \
0                      12-Bar Original
1                    A Day in the Life
2                   A Hard Day's Night
3           A Shot of Rhythm and Blues
4                     A Taste of Honey
..                                 ...
305     You're Going to Lose That Girl
306  You've Got to Hide Your Love Away
307     You've Really Got a Hold on Me
308                        Young Blood
309            Your Mother Should Know

                                                 Genre  \
0                                                Blues
1                 Psychedelic Rock, Art Rock, Pop/Rock
2                           Rock, Electronic, Pop/Rock
3                                        R&B, Pop/Rock
4                         Pop/Rock, Jazz, Stage&Screen
..                                                 ...
305                                     Rock, Pop/Rock
306                                       FolkPop/Rock
307                                     Soul, Pop/Rock
308                                           Pop/Rock
309  Music Hall, Vaudeville Rock, Psychedelic Pop, ...

                                  Songwriter              Lead.vocal  \
0    Lennon, McCartney, Harrison and Starkey                     NaN
1                       Lennon and McCartney    Lennon and McCartney
2                                     Lennon  Lennon, with McCartney
3                                   Thompson                  Lennon
4                              Scott, Marlow               McCartney
..                                       ...                     ...
305                                   Lennon                  Lennon
306                                   Lennon                  Lennon
307                                 Robinson     Lennon and Harrison
308                          Leiber, Stoller                Harrison
309                                McCartney               McCartney

     Top.50.Billboard
0                  -1
1                  -1
2                   8
3                  -1
4                  -1
..                ...
305                -1
306                -1
307                -1
308                -1
309                -1

[310 rows x 5 columns]>

#### Save the resulting datasets
Based on [this](https://stackoverflow.com/q/16923281) and [this](https://stackoverflow.com/a/25230582).<br>
As iti is suggested [here](https://stackoverflow.com/a/25230582), iti is a good idea to include `index=False` in the call to `to_csv()` in order to avoid the index being saved as a separate column in the resulting `csv` file. See [Merge the two datasets into one, keeping only the relevant columns](#Merge-the-two-datasets-into-one,-keeping-only-the-relevant-columns) below or [this](https://stackoverflow.com/a/42978156) for details on how to eliminate this unnamed extra column from the `csv` file if it is present there.

In [12]:
songs1.to_csv('data/The Beatles songs dataset, v2, no NAs, left.csv', index=False)
songs2.to_csv('data/The Beatles songs dataset, v2, no NAs, right.csv', index=False)
# songs1.to_csv('data/The Beatles songs dataset, v2, no NAs, left.csv')     # saves the csv file with the unnamed index column
# songs2.to_csv('data/The Beatles songs dataset, v2, no NAs, right.csv')    # saves the csv file with the unnamed index column

### Exercise 2
Using the two datasets generated in [Exercise 1](#Exercise-1), rank The Beatles albums released between 1962 and 1966 by the proportion of John Lennon's appearance as the lead vocalist in the songs from the corresponding album. Assume that the lead vocalist's name is listed as the first one in the `Lead.vocal` column. As for the album titles, take into account only the titles of the UK releases.

#### Read the datasets

In [13]:
songs1 = pd.read_csv('data/The Beatles songs dataset, v2, no NAs, left.csv')
songs2 = pd.read_csv('data/The Beatles songs dataset, v2, no NAs, right.csv')
# display(songs1.head)
# display(songs2.head)

#### Merge the two datasets into one, keeping only the relevant columns

In [14]:
songs = pd.merge(songs1.drop(columns=['Duration', 'Other.releases'], axis=1),               # drop unnecessary columns (left)
                 songs2.drop(columns=['Genre', 'Songwriter', 'Top.50.Billboard'], axis=1),  # drop unnecessary columns (right)
                 left_on='Title', right_on='Song title',
                 how='outer').drop('Song title', axis=1)                                    # drop duplicate info

# songs.drop(['Unnamed: 0_x', 'Unnamed: 0_y'], axis=1).head  # in case the csv file(s) has (have) been created w. the index col.

songs.head

<bound method NDFrame.head of                                  Title  Year  \
0                      12-Bar Original  1965
1                    A Day in the Life  1967
2                   A Hard Day's Night  1964
3           A Shot of Rhythm and Blues  1963
4                     A Taste of Honey  1963
..                                 ...   ...
307     You're Going to Lose That Girl  1965
308  You've Got to Hide Your Love Away  1965
309     You've Really Got a Hold on Me  1963
310                        Young Blood  1963
311            Your Mother Should Know  1967

                                           Album.debut              Lead.vocal
0                                          Anthology 2                     NaN
1                Sgt. Pepper's Lonely Hearts Club Band    Lennon and McCartney
2                 UK: A Hard Day's Night US: 1962-1966  Lennon, with McCartney
3                                      Live at the BBC                  Lennon
4           UK: Please Please Me US: The Early Beatles               McCartney
..                                                 ...                     ...
307                                              Help!                  Lennon
308                                              Help!                  Lennon
309  UK: With the Beatles US: The Beatles Second Album     Lennon and Harrison
310                                    Live at the BBC                Harrison
311                               Magical Mystery Tour               McCartney

[312 rows x 4 columns]>

#### Check for possible NA values in the resulting dataframe

In [15]:
songs.isnull().any()

Title          False
Year           False
Album.debut     True
Lead.vocal      True
dtype: bool

There *are* NA values in the `Album.debut` and `Lead.vocal` columns.

Check the songs with NA values in the `Album.debut` column and, for convenience, replace these NA values with `Unknown`:

In [16]:
# songs[songs['Album.debut'].isnull()].head()
display(len(songs[songs['Album.debut'].isnull()]))           # the number of rows with NA values in the Album.debut column
display(len(songs[songs['Lead.vocal'].isnull()]))            # the number of rows with NA values in the Lead.vocal column

display(songs[songs['Album.debut'].isnull()])                # check what are the songs with NA for Album.debut
# For convenience, 
# replace the NA values in the Album.debut column 
# with 'Unknown'
# songs[songs['Album.debut'].isnull()]['Album.debut'] = \    # not recommended; throws warnings
#     'Unknown'
songs.loc[songs['Album.debut'].isnull(), 'Album.debut'] = \
    'Unknown'
display(songs[songs['Album.debut'].isnull()])                # verify that there are no more NA values in the Album.debut column
display(len(songs[songs['Album.debut'].isnull()]))
display(songs[songs['Album.debut'] == 'Unknown'])

22

8

                         Title  Year Album.debut               Lead.vocal
37                    Catswalk  1962         NaN                      NaN
42                     Circles  1968         NaN                 Harrison
64                    Etcetera  1968         NaN                McCartney
85                     Goodbye  1969         NaN                McCartney
89                     Heather  1968         NaN                McCartney
112      I Lost My Little Girl  1962         NaN                   Lennon
127    I'll Keep You Satisfied  1963         NaN  Lennon and/or McCartney
150            Jazz Piano Song  1969         NaN                McCartney
151             Jessie's Dream  1967         NaN                      NaN
167              Looking Glass  1962         NaN                McCartney
169          Love of the Loved  1962         NaN                McCartney
174                     Madman  1969         NaN                   Lennon
201         One and One Is Two  1964         NaN                McCartney
223      September in the Rain  1962         NaN                McCartney
227     Shakin' in the Sixties  1969         NaN                   Lennon
240              Sour Milk Sea  1968         NaN                 Harrison
246  Take Good Care of My Baby  1962         NaN                 Harrison
264                 The Saints  1962         NaN                 Sheridan
274           Tip of My Tongue  1962         NaN         McCartney/Lennon
281          Watching Rainbows  1969         NaN                   Lennon
291             Winston's Walk  1960         NaN                      NaN
294                      Woman  1965         NaN                McCartney

Empty DataFrame
Columns: [Title, Year, Album.debut, Lead.vocal]
Index: []

0

                         Title  Year Album.debut               Lead.vocal
37                    Catswalk  1962     Unknown                      NaN
42                     Circles  1968     Unknown                 Harrison
64                    Etcetera  1968     Unknown                McCartney
85                     Goodbye  1969     Unknown                McCartney
89                     Heather  1968     Unknown                McCartney
112      I Lost My Little Girl  1962     Unknown                   Lennon
127    I'll Keep You Satisfied  1963     Unknown  Lennon and/or McCartney
150            Jazz Piano Song  1969     Unknown                McCartney
151             Jessie's Dream  1967     Unknown                      NaN
167              Looking Glass  1962     Unknown                McCartney
169          Love of the Loved  1962     Unknown                McCartney
174                     Madman  1969     Unknown                   Lennon
201         One and One Is Two  1964     Unknown                McCartney
223      September in the Rain  1962     Unknown                McCartney
227     Shakin' in the Sixties  1969     Unknown                   Lennon
240              Sour Milk Sea  1968     Unknown                 Harrison
246  Take Good Care of My Baby  1962     Unknown                 Harrison
264                 The Saints  1962     Unknown                 Sheridan
274           Tip of My Tongue  1962     Unknown         McCartney/Lennon
281          Watching Rainbows  1969     Unknown                   Lennon
291             Winston's Walk  1960     Unknown                      NaN
294                      Woman  1965     Unknown                McCartney

Check the songs with NA values in the `Lead.vocal` column and, for convenience, replace these NA values with `Instrumental/Unknown`:

In [17]:
display(songs[songs['Lead.vocal'].isnull()])                 # check what are the songs with NA for Lead.vocal
# For convenience, 
# replace the NA values in the Lead.vocal column 
# with 'Instrumental/Unknown'
# songs[songs['Lead.vocal'].isnull()]['Lead.vocal'] = \      # not recommended; throws warnings
#     'Unknown'
songs.loc[songs['Lead.vocal'].isnull(), 'Lead.vocal'] = \
    'Instrumental/Unknown'
display(songs[songs['Lead.vocal'].isnull()])                 # verify that there are no more NA values in the Lead.vocal column
display(len(songs[songs['Lead.vocal'].isnull()]))
display(songs[songs['Lead.vocal'] == 'Instrumental/Unknown'])

                Title  Year           Album.debut Lead.vocal
0     12-Bar Original  1965           Anthology 2        NaN
37           Catswalk  1962               Unknown        NaN
38            Cayenne  1960           Anthology 1        NaN
47   Cry for a Shadow  1961           Anthology 1        NaN
70             Flying  1967  Magical Mystery Tour        NaN
151    Jessie's Dream  1967               Unknown        NaN
214      Revolution 9  1968           The Beatles        NaN
291    Winston's Walk  1960               Unknown        NaN

Empty DataFrame
Columns: [Title, Year, Album.debut, Lead.vocal]
Index: []

0

                Title  Year           Album.debut            Lead.vocal
0     12-Bar Original  1965           Anthology 2  Instrumental/Unknown
37           Catswalk  1962               Unknown  Instrumental/Unknown
38            Cayenne  1960           Anthology 1  Instrumental/Unknown
47   Cry for a Shadow  1961           Anthology 1  Instrumental/Unknown
70             Flying  1967  Magical Mystery Tour  Instrumental/Unknown
151    Jessie's Dream  1967               Unknown  Instrumental/Unknown
214      Revolution 9  1968           The Beatles  Instrumental/Unknown
291    Winston's Walk  1960               Unknown  Instrumental/Unknown

Check the entire dataframe for NA values again:

In [288]:
songs.isnull().any()

Title          False
Year           False
Album.debut    False
Lead.vocal     False
dtype: bool

No more NA values.

#### Select the relevant subset of the dataframe

In [289]:
songs = songs[(songs['Year'] >= 1962) & (songs['Year'] <= 1966)]
display(songs.head())
display(len(songs))

,Title,Year,Album.debut,Lead.vocal
0,12-Bar Original,1965,Anthology 2,Instrumental/Unknown
2,A Hard Day's Night,1964,UK: A Hard Day's Night US: 1962-1966,"Lennon, with McCartney"
3,A Shot of Rhythm and Blues,1963,Live at the BBC,Lennon
4,A Taste of Honey,1963,UK: Please Please Me US: The Early Beatles,McCartney
6,Act Naturally,1965,UK: Help! US: Yesterday and Today,Starkey

185

An alternative way to do it is to use the [`groupby()-get_group()` approach](#get_group()) and then [`pd.concat()`](#pd.concat()) the groups for the relevant years.

#### Compute the rank

Modify the `Album.debut` column to contain only the titles of the UK releases (**<u>note the use of</u> `pd.DataFrame.str.rpartition()`, `pd.DataFrame.str.rstrip()` and `pd.DataFrame.str.lstrip()`** to split the album titles, similarly to using `pd.DataFrame.str.startswith()` below; based on [this](https://stackoverflow.com/a/17958424); check also [`rpartition()` documentation](https://docs.python.org/3/library/stdtypes.html#str.rpartition) for the explanation of how `rpartition()` works, as well as [this](https://stackoverflow.com/a/21844040) for the explanation of how `find()` works):

In [290]:
uk_album = songs['Album.debut'].str.find('US:')
# uk_album.head()
songs.loc[uk_album != -1, 'Album.debut'] = \
    songs.loc[uk_album != -1, ('Album.debut')].str.rpartition('US:')[0].str.rstrip().str.lstrip('UK: ')

C:\Users\Vladan\anaconda3\lib\site-packages\pandas\core\indexing.py:965: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

The warning thrown in the above cell apparently has no effect - see [this](https://stackoverflow.com/a/27367693/1899061) and [this](https://stackoverflow.com/a/23296545/1899061).

In [291]:
display(songs.loc[uk_album != -1, 'Album.debut'].head())
display(songs.loc[uk_album != -1, 'Album.debut'].index)
display(songs.loc[[2, 4, 6], 'Album.debut'].head())
rows = songs.loc[uk_album != -1, 'Album.debut'].index
display(songs.loc[rows, 'Album.debut'])

2    A Hard Day's Night
4      Please Please Me
6                 Help!
8      With the Beatles
9      With the Beatles
Name: Album.debut, dtype: object

Int64Index([  2,   4,   6,   8,   9,  13,  14,  15,  17,  18,  19,  20,  23,
             32,  34,  39,  49,  51,  54,  55,  56,  57,  61,  62,  65,  67,
             74, 100, 101, 105, 106, 107, 115, 116, 117, 118, 122, 124, 125,
            126, 128, 131, 134, 141, 142, 143, 147, 149, 155, 157, 163, 165,
            168, 179, 184, 185, 188, 190, 192, 195, 204, 205, 208, 209, 211,
            217, 219, 229, 231, 234, 235, 250, 251, 252, 267, 268, 270, 273,
            278, 282, 283, 284, 286, 295, 298, 299, 300, 303, 309],
           dtype='int64')

2    A Hard Day's Night
4      Please Please Me
6                 Help!
Name: Album.debut, dtype: object

2      A Hard Day's Night
4        Please Please Me
6                   Help!
8        With the Beatles
9        With the Beatles
              ...
298              Rarities
299                 Help!
300    A Hard Day's Night
303                 Help!
309      With the Beatles
Name: Album.debut, Length: 89, dtype: object

In [292]:
songs['Album.debut']

0             Anthology 2
2      A Hard Day's Night
3         Live at the BBC
4        Please Please Me
6                   Help!
              ...
305           Rubber Soul
307                 Help!
308                 Help!
309      With the Beatles
310       Live at the BBC
Name: Album.debut, Length: 185, dtype: object

Sort the songs according to the `Album.debut` column; based on [this](https://stackoverflow.com/questions/37787698/how-to-sort-pandas-dataframe-from-one-column):

In [293]:
# songs.sort_values('Album.debut', inplace=True)                 # throws a warning, so better use the next line
songs = songs.sort_values('Album.debut')

In [294]:
songs

,Title,Year,Album.debut,Lead.vocal
74,From Me to You,1963,A Collection of Beatles Oldies,Lennon and McCartney
229,She Loves You,1963,A Collection of Beatles Oldies,Lennon and McCartney
205,Paperback Writer,1966,A Collection of Beatles Oldies,McCartney
49,Day Tripper,1965,A Collection of Beatles Oldies,Lennon and McCartney
107,I Feel Fine,1964,A Collection of Beatles Oldies,Lennon
...,...,...,...,...
51,Devil in Her Heart,1963,With the Beatles,Harrison
219,Roll Over Beethoven,1963,With the Beatles,Harrison
57,Don't Bother Me,1963,With the Beatles,Harrison
185,Money (That's What I Want),1963,With the Beatles,Lennon
163,Little Child,1963,With the Beatles,Lennon and McCartney

Re-index the dataframe, for convenience (optional). Use the Album.debut column as the new index:

In [295]:
display(songs.columns)
songs.set_index('Album.debut', inplace=True)
display(songs.head())                                                                 # pretty display

Index(['Title', 'Year', 'Album.debut', 'Lead.vocal'], dtype='object')

                                           Title  Year            Lead.vocal
Album.debut
A Collection of Beatles Oldies    From Me to You  1963  Lennon and McCartney
A Collection of Beatles Oldies     She Loves You  1963  Lennon and McCartney
A Collection of Beatles Oldies  Paperback Writer  1966             McCartney
A Collection of Beatles Oldies       Day Tripper  1965  Lennon and McCartney
A Collection of Beatles Oldies       I Feel Fine  1964                Lennon

Play a little with the newly arranged `songs` dataframe; somewhat based on [this](https://stackoverflow.com/questions/15943769/how-do-i-get-the-row-count-of-a-pandas-dataframe):

In [296]:
# Different ways
display(len(songs))                                                    # 185
display(len(songs.index))                                              # 185
display(songs.shape[0])                                                # 185
print()

display(len(songs.loc['A Collection of Beatles Oldies']))              # 8
display(songs.loc['A Collection of Beatles Oldies'])
display(type(songs.loc['A Collection of Beatles Oldies']))             # pandas.core.frame.DataFrame
print()

display(len(songs.loc['Sgt. Pepper\'s Lonely Hearts Club Band']))      # 3, although there is only one song there; in this case,
display(songs.loc['Sgt. Pepper\'s Lonely Hearts Club Band'])           # it is the length of the resulting Series object (row)
display(type(songs.loc['Sgt. Pepper\'s Lonely Hearts Club Band']))     # pandas.core.series.Series
print()

display(songs.loc['Sgt. Pepper\'s Lonely Hearts Club Band'].shape)     # shape, instead of len(); it clearly shows that 
display(songs.loc['Sgt. Pepper\'s Lonely Hearts Club Band'])           # the type of the resulting Series object (row) is not 
display(type(songs.loc['Sgt. Pepper\'s Lonely Hearts Club Band']))     # pandas.core.series.DataFrame
print()

display(songs.index)                                                   # shows all indices, even though many of them repeat
display(songs.index.unique())                                          # shows only unique indices
print()

for i in songs.index.unique():                                         # see what are the real albums there; if songs.loc[i]
    display(i, songs.loc[i])                                           # doesn't show at least 2 songs, it's not an album

185

185

185

8

,Title,Year,Lead.vocal
Album.debut,,,
A Collection of Beatles Oldies,From Me to You,1963,Lennon and McCartney
A Collection of Beatles Oldies,She Loves You,1963,Lennon and McCartney
A Collection of Beatles Oldies,Paperback Writer,1966,McCartney
A Collection of Beatles Oldies,Day Tripper,1965,Lennon and McCartney
A Collection of Beatles Oldies,I Feel Fine,1964,Lennon
A Collection of Beatles Oldies,We Can Work It Out,1965,"McCartney, with Lennon"
A Collection of Beatles Oldies,Bad Boy,1965,Lennon
A Collection of Beatles Oldies,I Want to Hold Your Hand,1963,Lennon and McCartney

pandas.core.frame.DataFrame

3

Title         When I'm Sixty-Four
Year                         1966
Lead.vocal              McCartney
Name: Sgt. Pepper's Lonely Hearts Club Band, dtype: object

pandas.core.series.Series

(3,)

Title         When I'm Sixty-Four
Year                         1966
Lead.vocal              McCartney
Name: Sgt. Pepper's Lonely Hearts Club Band, dtype: object

pandas.core.series.Series

Index(['A Collection of Beatles Oldies', 'A Collection of Beatles Oldies',
       'A Collection of Beatles Oldies', 'A Collection of Beatles Oldies',
       'A Collection of Beatles Oldies', 'A Collection of Beatles Oldies',
       'A Collection of Beatles Oldies', 'A Collection of Beatles Oldies',
       'A Hard Day's Night', 'A Hard Day's Night',
       ...
       'With the Beatles', 'With the Beatles', 'With the Beatles',
       'With the Beatles', 'With the Beatles', 'With the Beatles',
       'With the Beatles', 'With the Beatles', 'With the Beatles',
       'With the Beatles'],
      dtype='object', name='Album.debut', length=185)

Index(['A Collection of Beatles Oldies', 'A Hard Day's Night', 'Anthology 1',
       'Anthology 2', 'Beatles for Sale', 'Help!', 'Live at the BBC',
       'Live! at the Star-Club in Hamburg, Germany; 1962',
       'Magical Mystery Tour', 'On Air - Live at the BBC Volume 2',
       'Past Masters Volume 1', 'Please Please Me', 'Rarities', 'Revolver',
       'Rock 'n' Roll Music', 'Rubber Soul',
       'Sgt. Pepper's Lonely Hearts Club Band',
       'The Beatles Bootleg Recordings 1963', 'Unknown', 'With the Beatles'],
      dtype='object', name='Album.debut')

'A Collection of Beatles Oldies'

,Title,Year,Lead.vocal
Album.debut,,,
A Collection of Beatles Oldies,From Me to You,1963,Lennon and McCartney
A Collection of Beatles Oldies,She Loves You,1963,Lennon and McCartney
A Collection of Beatles Oldies,Paperback Writer,1966,McCartney
A Collection of Beatles Oldies,Day Tripper,1965,Lennon and McCartney
A Collection of Beatles Oldies,I Feel Fine,1964,Lennon
A Collection of Beatles Oldies,We Can Work It Out,1965,"McCartney, with Lennon"
A Collection of Beatles Oldies,Bad Boy,1965,Lennon
A Collection of Beatles Oldies,I Want to Hold Your Hand,1963,Lennon and McCartney

"A Hard Day's Night"

,Title,Year,Lead.vocal
Album.debut,,,
A Hard Day's Night,Things We Said Today,1964,McCartney
A Hard Day's Night,Can't Buy Me Love,1964,"McCartney, with Lennon"
A Hard Day's Night,Tell Me Why,1964,Lennon
A Hard Day's Night,When I Get Home,1964,Lennon
A Hard Day's Night,I Should Have Known Better,1964,Lennon
A Hard Day's Night,Any Time at All,1964,"Lennon, with McCartney"
A Hard Day's Night,A Hard Day's Night,1964,"Lennon, with McCartney"
A Hard Day's Night,I'm Happy Just to Dance with You,1964,Harrison
A Hard Day's Night,I'll Cry Instead,1964,Lennon
A Hard Day's Night,If I Fell,1964,"Lennon, with McCartney"
A Hard Day's Night,You Can't Do That,1964,Lennon
A Hard Day's Night,I'll Be Back,1964,"Lennon, with McCartney"
A Hard Day's Night,And I Love Her,1964,McCartney

'Anthology 1'

,Title,Year,Lead.vocal
Album.debut,,,
Anthology 1,Moonlight Bay,1963,"Lennon, McCartney, Harrison, Eric Morecambe, E..."
Anthology 1,Bésame Mucho,1962,McCartney
Anthology 1,You Know What to Do,1964,Harrison
Anthology 1,How Do You Do It?,1962,Lennon
Anthology 1,Like Dreamers Do,1962,McCartney
Anthology 1,Leave My Kitten Alone,1964,Lennon
Anthology 1,The Sheik of Araby,1962,Harrison
Anthology 1,Lend Me Your Comb,1963,Lennon and McCartney
Anthology 1,Searchin',1962,McCartney
Anthology 1,Hello Little Girl,1962,Lennon
Anthology 1,Shout,1964,"Lennon, McCartney, Harrison and Starkey"
Anthology 1,Three Cool Cats,1962,Harrison

'Anthology 2'

                             Title  Year            Lead.vocal
Album.debut
Anthology 2  If You've Got Trouble  1965               Starkey
Anthology 2        12-Bar Original  1965  Instrumental/Unknown
Anthology 2       That Means a Lot  1965             McCartney

'Beatles for Sale'

,Title,Year,Lead.vocal
Album.debut,,,
Beatles for Sale,No Reply,1964,"Lennon, with McCartney"
Beatles for Sale,What You're Doing,1964,McCartney
Beatles for Sale,I Don't Want to Spoil the Party,1964,Lennon
Beatles for Sale,Baby's in Black,1964,Lennon and McCartney
Beatles for Sale,Words of Love,1964,Lennon and McCartney
Beatles for Sale,Honey Don't,1964,Starkey
Beatles for Sale,Rock and Roll Music,1964,Lennon
Beatles for Sale,Eight Days a Week,1964,"Lennon, with McCartney"
Beatles for Sale,I'll Follow the Sun,1964,"McCartney, with Lennon"
Beatles for Sale,Mr. Moonlight,1964,Lennon
Beatles for Sale,"Kansas City/Hey, Hey, Hey, Hey",1964,McCartney
Beatles for Sale,I'm a Loser,1964,Lennon
Beatles for Sale,Everybody's Trying to Be My Baby,1964,Harrison
Beatles for Sale,Every Little Thing,1964,"Lennon, with McCartney"

'Help!'

                                         Title  Year              Lead.vocal
Album.debut
Help!                                Yesterday  1965               McCartney
Help!                             Another Girl  1965               McCartney
Help!                           It's Only Love  1965                  Lennon
Help!           You're Going to Lose That Girl  1965                  Lennon
Help!        You've Got to Hide Your Love Away  1965                  Lennon
Help!                               I Need You  1965                Harrison
Help!                            Act Naturally  1965                 Starkey
Help!                     You Like Me Too Much  1965                Harrison
Help!                    I've Just Seen a Face  1965               McCartney
Help!                                    Help!  1965                  Lennon
Help!                     Tell Me What You See  1965  McCartney, with Lennon
Help!                           Ticket to Ride  1965  Lennon, with McCartney
Help!                         The Night Before  1965               McCartney
Help!                        Dizzy, Miss Lizzy  1965                  Lennon

'Live at the BBC'

,Title,Year,Lead.vocal
Album.debut,,,
Live at the BBC,Sure to Fall (In Love with You),1963,McCartney
Live at the BBC,Some Other Guy,1963,Lennon and McCartney
Live at the BBC,Johnny B. Goode,1964,Lennon
Live at the BBC,Soldier of Love (Lay Down Your Arms),1963,Lennon
Live at the BBC,So How Come (No One Loves Me),1963,Harrison
Live at the BBC,That's All Right (Mama),1963,McCartney
Live at the BBC,"Memphis, Tennessee",1963,Lennon
Live at the BBC,Too Much Monkey Business,1963,Lennon
Live at the BBC,Ooh! My Soul,1963,McCartney
Live at the BBC,Lonesome Tears in My Eyes,1963,Lennon
Live at the BBC,To Know Her is to Love Her,1963,Lennon
Live at the BBC,Lucille,1963,McCartney
Live at the BBC,Nothin' Shakin' (But the Leaves on the Trees),1963,Harrison
Live at the BBC,The Honeymoon Song,1963,McCartney
Live at the BBC,Sweet Little Sixteen,1963,Lennon
Live at the BBC,Keep Your Hands Off My Baby,1963,Lennon
Live at the BBC,Young Blood,1963,Harrison
Live at the BBC,A Shot of Rhythm and Blues,1963,Lennon
Live at the BBC,Carol,1963,Lennon
Live at the BBC,Clarabella,1963,McCartney
Live at the BBC,"Crying, Waiting, Hoping",1963,Harrison
Live at the BBC,Don't Ever Change,1963,Harrison
Live at the BBC,From Us to You,1963,Lennon and McCartney
Live at the BBC,Glad All Over,1963,Harrison
Live at the BBC,I'm Gonna Sit Right Down and Cry (Over You),1963,Lennon
Live at the BBC,Hippy Hippy Shake,1963,McCartney
Live at the BBC,I Forgot to Remember to Forget,1964,Harrison
Live at the BBC,I Got a Woman,1963,Lennon
Live at the BBC,I Got to Find My Baby,1963,Lennon
Live at the BBC,I Just Don't Understand,1963,Lennon
Live at the BBC,I'll Be on My Way,1963,Lennon

'Live! at the Star-Club in Hamburg, Germany; 1962'

,Title,Year,Lead.vocal
Album.debut,,,
"Live! at the Star-Club in Hamburg, Germany; 1962",I'm Talking About You,1962,Lennon
"Live! at the Star-Club in Hamburg, Germany; 1962",I'm Talking About You,1962,Lennon

'Magical Mystery Tour'

                                          Title  Year Lead.vocal
Album.debut
Magical Mystery Tour                 Penny Lane  1966  McCartney
Magical Mystery Tour  Strawberry Fields Forever  1966     Lennon

'On Air - Live at the BBC Volume 2'

                                                   Title  Year Lead.vocal
Album.debut
On Air - Live at the BBC Volume 2  I'm Talking About You  1963     Lennon
On Air - Live at the BBC Volume 2  I'm Talking About You  1963     Lennon
On Air - Live at the BBC Volume 2      Beautiful Dreamer  1963  McCartney

'Past Masters Volume 1'

                                  Title  Year              Lead.vocal
Album.debut
Past Masters Volume 1  I Call Your Name  1964                  Lennon
Past Masters Volume 1      I'll Get You  1963  Lennon, with McCartney

'Please Please Me'

,Title,Year,Lead.vocal
Album.debut,,,
Please Please Me,There's a Place,1963,Lennon and McCartney
Please Please Me,Chains,1963,"Harrison, with Lennon and McCartney"
Please Please Me,Boys,1963,Starkey (Best)
Please Please Me,Twist and Shout,1963,Lennon
Please Please Me,Please Please Me,1962,"Lennon, with McCartney"
Please Please Me,Misery,1963,"Lennon, with McCartney"
Please Please Me,Baby It's You,1963,Lennon
Please Please Me,Ask Me Why,1962,Lennon
Please Please Me,I Saw Her Standing There,1963,"McCartney, with Lennon"
Please Please Me,Do You Want to Know a Secret?,1963,Harrison
Please Please Me,Anna (Go to Him),1963,Lennon
Please Please Me,Love Me Do,1962,"McCartney, with Lennon"
Please Please Me,A Taste of Honey,1963,McCartney
Please Please Me,P.S. I Love You,1962,McCartney

'Rarities'

,Title,Year,Lead.vocal
Album.debut,,,
Rarities,Rain,1966,Lennon
Rarities,Thank You Girl,1963,Lennon and McCartney
Rarities,She's a Woman,1964,McCartney
Rarities,Sie Liebt Dich,1964,Lennon-McCartney
Rarities,This Boy,1963,"Lennon, with McCartney and Harrison"
Rarities,Komm Gib Mir Deine Hand,1964,Lennon and McCartney
Rarities,Yes It Is,1965,"Lennon, McCartney and Harrison"

'Revolver'

                                   Title  Year Lead.vocal
Album.debut
Revolver                Yellow Submarine  1966    Starkey
Revolver                   Doctor Robert  1966     Lennon
Revolver          And Your Bird Can Sing  1966     Lennon
Revolver                          Taxman  1966   Harrison
Revolver                   Eleanor Rigby  1966  McCartney
Revolver              I Want to Tell You  1966   Harrison
Revolver               I'm Only Sleeping  1966     Lennon
Revolver            Tomorrow Never Knows  1966     Lennon
Revolver                      For No One  1966  McCartney
Revolver                     Love You To  1966   Harrison
Revolver               Good Day Sunshine  1966  McCartney
Revolver               She Said She Said  1966     Lennon
Revolver     Got to Get You into My Life  1966  McCartney
Revolver      Here, There and Everywhere  1966  McCartney

"Rock 'n' Roll Music"

                               Title  Year      Lead.vocal
Album.debut
Rock 'n' Roll Music        Slow Down  1964          Lennon
Rock 'n' Roll Music         Matchbox  1964  Starkey (Best)
Rock 'n' Roll Music         I'm Down  1965       McCartney
Rock 'n' Roll Music  Long Tall Sally  1964       McCartney

'Rubber Soul'

,Title,Year,Lead.vocal
Album.debut,,,
Rubber Soul,The Word,1965,"Lennon, McCartney and Harrison"
Rubber Soul,Wait,1965,"McCartney, with Lennon"
Rubber Soul,I'm Looking Through You,1965,"McCartney, with Lennon"
Rubber Soul,What Goes On,1965,Starkey
Rubber Soul,You Won't See Me,1965,McCartney
Rubber Soul,If I Needed Someone,1965,Harrison
Rubber Soul,Run for Your Life,1965,Lennon
Rubber Soul,Think for Yourself,1965,Harrison
Rubber Soul,Drive My Car,1965,"McCartney, with Lennon"
Rubber Soul,Michelle,1965,McCartney
Rubber Soul,Girl,1965,Lennon
Rubber Soul,In My Life,1965,Lennon
Rubber Soul,Nowhere Man,1965,Lennon
Rubber Soul,Norwegian Wood (This Bird Has Flown),1965,Lennon

"Sgt. Pepper's Lonely Hearts Club Band"

Title         When I'm Sixty-Four
Year                         1966
Lead.vocal              McCartney
Name: Sgt. Pepper's Lonely Hearts Club Band, dtype: object

'The Beatles Bootleg Recordings 1963'

                                           Title  Year Lead.vocal
Album.debut
The Beatles Bootleg Recordings 1963    Bad to Me  1963     Lennon
The Beatles Bootleg Recordings 1963  I'm In Love  1963     Lennon

'Unknown'

                                 Title  Year               Lead.vocal
Album.debut
Unknown              Love of the Loved  1962                McCartney
Unknown        I'll Keep You Satisfied  1963  Lennon and/or McCartney
Unknown                       Catswalk  1962     Instrumental/Unknown
Unknown                  Looking Glass  1962                McCartney
Unknown             One and One Is Two  1964                McCartney
Unknown                          Woman  1965                McCartney
Unknown                     The Saints  1962                 Sheridan
Unknown      Take Good Care of My Baby  1962                 Harrison
Unknown          September in the Rain  1962                McCartney
Unknown               Tip of My Tongue  1962         McCartney/Lennon
Unknown          I Lost My Little Girl  1962                   Lennon

'With the Beatles'

                                           Title  Year            Lead.vocal
Album.debut
With the Beatles                   All My Loving  1963             McCartney
With the Beatles              All I've Got to Do  1963                Lennon
With the Beatles             I Wanna Be Your Man  1963               Starkey
With the Beatles                It Won't Be Long  1963                Lennon
With the Beatles  You've Really Got a Hold on Me  1963   Lennon and Harrison
With the Beatles               Not a Second Time  1963                Lennon
With the Beatles              Till There Was You  1963             McCartney
With the Beatles                   Hold Me Tight  1963             McCartney
With the Beatles              Please Mr. Postman  1963                Lennon
With the Beatles              Devil in Her Heart  1963              Harrison
With the Beatles             Roll Over Beethoven  1963              Harrison
With the Beatles                 Don't Bother Me  1963              Harrison
With the Beatles      Money (That's What I Want)  1963                Lennon
With the Beatles                    Little Child  1963  Lennon and McCartney

Only the `Sgt. Pepper's Lonely Hearts Club Band` index has only one corresponding row, and it will require special attention.

Compute the number of songs per album:

In [297]:
result = pd.DataFrame(index=songs.index.unique(), columns=['No. of songs'])   # create an 'empty' df (i.e., with all NaN values)
# display(result)
# display(result.columns)
# display(result.index)

for i in result.index.unique():                                               # replace NaN values with the numbers of songs
    result.loc[i, 'No. of songs'] = \
        len(songs.loc[i]) if len(songs.loc[i].shape) != 1 else 1

# # Alternative for the above lines, plus the explanation
# for i in result.index.unique():                                             # replace NaN values with the numbers of songs
#     if len(songs.loc[i].shape) != 1:                                        # shape (m, n): more than 1 row is indexed by i
#         result.loc[i, 'No. of songs'] = len(songs.loc[i])
#     else:                                                                   # shape (m, ): only one row is indexed by i
#         result.loc[i, 'No. of songs'] = 1

# # Yet another alternative for the above lines, plus the explanation
# # result.loc['Help!', 'No. of songs']
# for i in result.index.unique():                                             # replace NaN values with the numbers of songs
#     result.loc[i, 'No. of songs'] = len(songs.loc[i])
# #     display(i, result.loc[i, 'No. of songs'])

# # display(result.index[result['No. of songs'] == 3])                        # double-check those where 'No. of songs' is 3
# for i in result.index[result['No. of songs'] == 3]:
#     display(songs.loc[i])

# result.loc['Sgt. Pepper\'s Lonely Hearts Club Band', 'No. of songs'] = 1    # only 'Sgt. Pepper' should be set to 1

display(result)

                                                 No. of songs
Album.debut
A Collection of Beatles Oldies                              8
A Hard Day's Night                                         13
Anthology 1                                                12
Anthology 2                                                 3
Beatles for Sale                                           14
Help!                                                      14
Live at the BBC                                            31
Live! at the Star-Club in Hamburg, Germany; 1962            2
Magical Mystery Tour                                        2
On Air - Live at the BBC Volume 2                           3
Past Masters Volume 1                                       2
Please Please Me                                           14
Rarities                                                    7
Revolver                                                   14
Rock 'n' Roll Music                                         4
Rubber Soul                                                14
Sgt. Pepper's Lonely Hearts Club Band                       1
The Beatles Bootleg Recordings 1963                         2
Unknown                                                    11
With the Beatles                                           14

For each album, compute the number of songs where John Lennon sings the lead vocal (**<u>note the use of</u> `pd.DataFrame.str.startswith()`**, similar to using `pd.DataFrame.str.rpartition()`, `pd.DataFrame.str.rstrip()` and `pd.DataFrame.str.lstrip()` above; based on [this](https://stackoverflow.com/a/17958424)).

In `songs`, select and keep only the rows where John Lennon is the lead vocalist:

In [298]:
# display(songs['Lead.vocal'].str.startswith('Lennon'))
songs = songs[songs['Lead.vocal'].str.startswith('Lennon')]
songs

# # display(songs.head)                                                               # not a pretty display
# display(songs.head())                                                               # pretty display
# np.sum(songs['Lennon as the lead vocal'])

,Title,Year,Lead.vocal
Album.debut,,,
A Collection of Beatles Oldies,From Me to You,1963,Lennon and McCartney
A Collection of Beatles Oldies,She Loves You,1963,Lennon and McCartney
A Collection of Beatles Oldies,Day Tripper,1965,Lennon and McCartney
A Collection of Beatles Oldies,I Feel Fine,1964,Lennon
A Collection of Beatles Oldies,Bad Boy,1965,Lennon
...,...,...,...
With the Beatles,You've Really Got a Hold on Me,1963,Lennon and Harrison
With the Beatles,Not a Second Time,1963,Lennon
With the Beatles,Please Mr. Postman,1963,Lennon
With the Beatles,Money (That's What I Want),1963,Lennon
With the Beatles,Little Child,1963,Lennon and McCartney

Update the `result` dataframe. **Note the use of `np.round()` (based on [this](https://numpy.org/doc/stable/reference/generated/numpy.round_.html)) and `pd.to_numeric()` (based on [this](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_numeric.html))** - `np.round()` works with arrays, not with `pd.Series` objects, that's why `pd.to_numeric()` is necessary:

In [299]:
result['Lennon as the lead vocal'] = 0          # add new column for the number of songs where John Lennon is the lead vocal
result['Proportion'] = 0                        # add new column for the proportion of songs where John Lennon is the lead vocal
display(result)

for i in songs.index.unique():
    result.loc[i, 'Lennon as the lead vocal'] = len(songs.loc[i]) if len(songs.loc[i].shape) != 1 else 1
    result['Proportion'] = result['Lennon as the lead vocal'] / result['No. of songs'] 

result['Proportion'] = np.round(pd.to_numeric(result['Proportion']), decimals=2)

display(result)

,No. of songs,Lennon as the lead vocal,Proportion
Album.debut,,,
A Collection of Beatles Oldies,8,0,0
A Hard Day's Night,13,0,0
Anthology 1,12,0,0
Anthology 2,3,0,0
Beatles for Sale,14,0,0
Help!,14,0,0
Live at the BBC,31,0,0
"Live! at the Star-Club in Hamburg, Germany; 1962",2,0,0
Magical Mystery Tour,2,0,0
On Air - Live at the BBC Volume 2,3,0,0
Past Masters Volume 1,2,0,0
Please Please Me,14,0,0
Rarities,7,0,0
Revolver,14,0,0
Rock 'n' Roll Music,4,0,0
Rubber Soul,14,0,0
Sgt. Pepper's Lonely Hearts Club Band,1,0,0
The Beatles Bootleg Recordings 1963,2,0,0
Unknown,11,0,0
With the Beatles,14,0,0

,No. of songs,Lennon as the lead vocal,Proportion
Album.debut,,,
A Collection of Beatles Oldies,8,6,0.75
A Hard Day's Night,13,9,0.69
Anthology 1,12,6,0.50
Anthology 2,3,0,0.00
Beatles for Sale,14,9,0.64
Help!,14,6,0.43
Live at the BBC,31,17,0.55
"Live! at the Star-Club in Hamburg, Germany; 1962",2,2,1.00
Magical Mystery Tour,2,1,0.50
On Air - Live at the BBC Volume 2,3,2,0.67
Past Masters Volume 1,2,2,1.00
Please Please Me,14,7,0.50
Rarities,7,6,0.86
Revolver,14,5,0.36
Rock 'n' Roll Music,4,1,0.25
Rubber Soul,14,6,0.43
Sgt. Pepper's Lonely Hearts Club Band,1,0,0.00
The Beatles Bootleg Recordings 1963,2,2,1.00
Unknown,11,2,0.18
With the Beatles,14,7,0.50

Rank the albums by the proportion of John Lennon's appearance as the lead vocalist in the songs from the corresponding album:

In [300]:
result = result.sort_values('Proportion', ascending=False)
result

,No. of songs,Lennon as the lead vocal,Proportion
Album.debut,,,
Past Masters Volume 1,2,2,1.00
"Live! at the Star-Club in Hamburg, Germany; 1962",2,2,1.00
The Beatles Bootleg Recordings 1963,2,2,1.00
Rarities,7,6,0.86
A Collection of Beatles Oldies,8,6,0.75
A Hard Day's Night,13,9,0.69
On Air - Live at the BBC Volume 2,3,2,0.67
Beatles for Sale,14,9,0.64
Live at the BBC,31,17,0.55
Magical Mystery Tour,2,1,0.50
Please Please Me,14,7,0.50
Anthology 1,12,6,0.50
With the Beatles,14,7,0.50
Help!,14,6,0.43
Rubber Soul,14,6,0.43
Revolver,14,5,0.36
Rock 'n' Roll Music,4,1,0.25
Unknown,11,2,0.18
Anthology 2,3,0,0.00
Sgt. Pepper's Lonely Hearts Club Band,1,0,0.00

## Aggregation
Refers to computing simple aggregations like `sum()`, `mean()`, `median()`, `min()`, and `max()`, as well as using the `groupby` operation in order to run more sophisticated aggregations.

### Simple aggregation

Read a dataset and check its column types:

In [64]:
songs = pd.read_csv('data/The Beatles songs dataset, v2, no NAs.csv')
display(songs.dtypes)

Title               object
Year                 int64
Album.debut         object
Duration             int64
Other.releases       int64
Genre               object
Songwriter          object
Lead.vocal          object
Top.50.Billboard     int64
dtype: object

#### `describe()` the entire dataframe
Computes several common aggregates for each column and returns the result. Pretty much like `summary()` in R. <br>By default, only numeric columns are taken into account in computation and the corresponding aggregates are returned. To compute aggregates for all columns, use `describe(include='all')`.<br>Note the use `dropna()` to omit rows with possible NA values.

In [65]:
display(songs.dropna().describe())
display(songs.dropna().describe(include='all'))

              Year    Duration  Other.releases  Top.50.Billboard
count   282.000000  282.000000      282.000000        282.000000
mean   1965.464539  158.631206       11.390071          3.570922
std       2.662609   51.859708       10.164325         11.680364
min    1958.000000   23.000000        0.000000         -1.000000
25%    1963.000000  130.000000        2.500000         -1.000000
50%    1965.000000  150.000000       10.000000         -1.000000
75%    1968.000000  173.750000       17.000000         -1.000000
max    1980.000000  467.000000       56.000000         50.000000

,Title,Year,Album.debut,Duration,Other.releases,Genre,Songwriter,Lead.vocal,Top.50.Billboard
count,282,282.000000,282,282.000000,282.000000,282,282,282,282.000000
unique,281,NaN,54,NaN,NaN,108,74,21,NaN
top,I'm Talking About You,NaN,Live at the BBC,NaN,NaN,Pop/Rock,Lennon,Lennon,NaN
freq,2,NaN,31,NaN,NaN,54,62,95,NaN
mean,NaN,1965.464539,NaN,158.631206,11.390071,NaN,NaN,NaN,3.570922
std,NaN,2.662609,NaN,51.859708,10.164325,NaN,NaN,NaN,11.680364
min,NaN,1958.000000,NaN,23.000000,0.000000,NaN,NaN,NaN,-1.000000
25%,NaN,1963.000000,NaN,130.000000,2.500000,NaN,NaN,NaN,-1.000000
50%,NaN,1965.000000,NaN,150.000000,10.000000,NaN,NaN,NaN,-1.000000
75%,NaN,1968.000000,NaN,173.750000,17.000000,NaN,NaN,NaN,-1.000000
max,NaN,1980.000000,NaN,467.000000,56.000000,NaN,NaN,NaN,50.000000

#### `describe()` a reduced version of the dataframe

Reduce the dataset to some numeric columns and make song titles indices of the `songs` dataframe:

In [66]:
cols = songs.columns.tolist()
display(cols)
cols1 = [cols[0]] + [cols[3]] + [cols[4]]
display(cols1)

['Title',
 'Year',
 'Album.debut',
 'Duration',
 'Other.releases',
 'Genre',
 'Songwriter',
 'Lead.vocal',
 'Top.50.Billboard']

['Title', 'Duration', 'Other.releases']

<u>Careful with `np.split()`, it converts numeric columns to `object` columns!</u> :

In [67]:
songs = songs.loc[:, cols1]
display(songs.head())
display(songs.dtypes)

songs.set_index(songs['Title'], inplace=True)
display(songs.columns.tolist())
display(songs.dtypes)                                 # up to this point, it's int64 for both Duration and Other.releases

songs = np.split(songs, [1], axis=1)[1]
display(songs.dtypes)                                 # but now it's object, for both Duration and Other.releases
display(songs.head())

                        Title  Duration  Other.releases
0             12-Bar Original       174               0
1           A Day in the Life       335              12
2          A Hard Day's Night       152              35
3  A Shot of Rhythm and Blues       104               0
4            A Taste of Honey       163              29

Title             object
Duration           int64
Other.releases     int64
dtype: object

['Title', 'Duration', 'Other.releases']

Title             object
Duration           int64
Other.releases     int64
dtype: object

Duration          object
Other.releases    object
dtype: object

                           Duration Other.releases
Title
12-Bar Original                 174              0
A Day in the Life               335             12
A Hard Day's Night              152             35
A Shot of Rhythm and Blues      104              0
A Taste of Honey                163             29

The output of `describe()` reflects the fact that now both `dtype`s are `object`:

In [68]:
display(songs.dtypes)
display(songs.dropna().describe(include='all'))       # the output reflects the fact that both dtypes are object

Duration          object
Other.releases    object
dtype: object

        Duration  Other.releases
count        310             310
unique       133              37
top          150               0
freq          32              94

Compute some simple aggregations. For a `pd.DataFrame` object, by default the aggregates return results within each column:

However, numeric aggregates are computed normally:

In [69]:
display(songs.min())
display(songs.iloc[23:34, :].mean())

Duration          23.0
Other.releases     0.0
dtype: float64

Duration          154.545455
Other.releases      6.818182
dtype: float64

Compute some simple aggregations by row (although semantically it makes no sense with the `songs` dataframe). It works in spite of the fact that both `dtype`s are `object`:

In [70]:
display(songs.sum(axis=1))

Title
12-Bar Original                      174.0
A Day in the Life                    347.0
A Hard Day's Night                   187.0
A Shot of Rhythm and Blues           104.0
A Taste of Honey                     192.0
                                     ...
You're Going to Lose That Girl       146.0
You've Got to Hide Your Love Away    143.0
You've Really Got a Hold on Me       184.0
Young Blood                          116.0
Your Mother Should Know              162.0
Length: 310, dtype: float64

Compute common aggregates for the `songs` dataframe. Use `dropna()` to omit rows with possible NA values. Since both `dtype`s are `object`, the output does not show mean, sd and the quartiles:

In [71]:
display(songs.isnull().any())
display(songs.dropna().describe())
# display(songs.dropna().describe(include='all'))
# display(songs.dropna().describe(include=[np.number]))
display(songs.dtypes)

Duration          False
Other.releases    False
dtype: bool

        Duration  Other.releases
count        310             310
unique       133              37
top          150               0
freq          32              94

Duration          object
Other.releases    object
dtype: object

Convert both columns from `object` to `int` in order to show mean, sd and the quartiles:

In [63]:
songs['Duration'] = songs['Duration'].astype(int)
songs['Other.releases'] = songs['Other.releases'].astype(int)
display(songs.dtypes)
display(songs.dropna().describe())

Duration          int32
Other.releases    int32
dtype: object

         Duration  Other.releases
count  310.000000      310.000000
mean   159.645161       10.422581
std     53.995774       10.197665
min     23.000000        0.000000
25%    133.000000        0.000000
50%    150.000000        9.000000
75%    172.750000       16.000000
max    502.000000       56.000000

### *groupby()* aggregation
Method of `pd.DataFrame` objects. <br><br>
Implements the split-apply-combine pattern:<br>
![](figures/split-apply-combine.png)

For a very simple example of grouping: see [this](https://www.kite.com/python/answers/how-to-split-a-pandas-dataframe-into-multiple-dataframes-by-column-value-in-python) - splitting a `pd.DataFrame` into multiple `pd.DataFrame`s by column value; all these `pd.DataFrame`s objects are included in the resulting `DataFrameGroupBy` object.<br>
VD: Note that the resulting `DataFrameGroupBy` object is actually a specific *view* of the original `pd.DataFrame` (pretty much like hashing; take a look at the figure above).

#### get_group()
An example - use `groupby()` to split The Beatles songs dataframe by year and then display specific groups using `get_group()`:

In [3]:
songs = pd.read_csv('data/The Beatles songs dataset, v2, no NAs.csv')
# songs_by_year = songs.groupby(songs.Year)                                   # this is OK as well
# songs_by_year = songs.groupby(songs['Year'])                                # this is OK as well
songs_by_year = songs.groupby('Year')
display(songs_by_year)
display(type(songs_by_year))                                                  # DataFrameGroupBy
display(songs_by_year.get_group(1970))
display(songs_by_year.get_group(1966).head())

pandas.core.groupby.generic.DataFrameGroupBy

,Title,Year,Album.debut,Duration,Other.releases,Genre,Songwriter,Lead.vocal,Top.50.Billboard
113,I Me Mine,1970,Let It Be,145,10,"Folk blues, Hard Rock, Pop/Rock",Harrison,Harrison,-1

,Title,Year,Album.debut,Duration,Other.releases,Genre,Songwriter,Lead.vocal,Top.50.Billboard
14,And Your Bird Can Sing,1966,UK: Revolver US: Yesterday and Today,121,9,"Power Pop, Psychedelic Pop, Pop/Rock","Lennon, with McCartney",Lennon,-1
56,Doctor Robert,1966,UK: Revolver US: Yesterday and Today,135,6,"Psychedelic Rock, Power Pop, Pop/Rock","Lennon, with McCartney",Lennon,-1
63,Eleanor Rigby,1966,Revolver,128,16,"Baroque Pop, Art Rock, Pop/Rock",McCartney,McCartney,38
71,For No One,1966,Revolver,121,9,"Baroque Pop, Pop/Rock",McCartney,McCartney,-1
82,Good Day Sunshine,1966,Revolver,129,7,"Sunshine Pop, Music Hall, Pop/Rock",McCartney,McCartney,-1

Extract and individual `pd.DataFrame` object and get its number of rows (see [this](https://stackoverflow.com/questions/15943769/how-do-i-get-the-row-count-of-a-pandas-dataframe) for a discussion on performance issues - `len(df.index)` is faster than `df.shape`):

In [16]:
y1966 = songs_by_year.get_group(1966)
display(type(y1966))
display(y1966.shape)
display(len(y1966.index))                                                     # faster than shape

pandas.core.frame.DataFrame

(19, 9)

19

#### The `GroupBy` object
Created by running the `groupby()` method of `pd.DataFrame`s.<br>
The `GroupBy` object is essentially a group of `pd.DataFrame`s.

Column indexing:

In [5]:
songs = pd.read_csv('data/The Beatles songs dataset, v2, no NAs.csv')
songs_by_year = songs.groupby('Year')
display(songs_by_year['Duration'])
display(type(songs_by_year['Duration']))                                      # SeriesGroupBy

pandas.core.groupby.generic.SeriesGroupBy

In [7]:
display(songs_by_year['Duration'].median())                                   # or sum(), mean(),...

Year
1958    150
1960    147
1961    150
1962    150
1963    137
1964    145
1965    148
1966    157
1967    180
1968    183
1969    165
1970    145
1977    266
1980    236
Name: Duration, dtype: int64

Iterating over groups - the `GroupBy` object supports direct iteration over the groups, returning each group as a `Series` or `DataFrame` (**<u>make sure to provide a tuple of inices for the `for` loop</u>**, the first one referring to the group index, and the second one representing the group itself):

In [17]:
for year, group in songs.groupby('Year'):
#     print(f'{year}   {group.shape}')
#     print(f'{year}   no. of songs released: {group.shape[0]}')
    print(f'{year}   no. of songs released: {len(group.index)}')              # faster than shape

1958   no. of songs released: 2
1960   no. of songs released: 4
1961   no. of songs released: 3
1962   no. of songs released: 20
1963   no. of songs released: 66
1964   no. of songs released: 41
1965   no. of songs released: 37
1966   no. of songs released: 19
1967   no. of songs released: 27
1968   no. of songs released: 45
1969   no. of songs released: 43
1970   no. of songs released: 1
1977   no. of songs released: 1
1980   no. of songs released: 1

Calling other methods (not explicitly implemented by the `GroupBy` object) on the groups, whether they are `pd.DataFrame` or `pd.Series` objects. *Any* valid `pd.DataFrame`/`pd.Series` method can be used on the corresponding `GroupBy` object. For example, using the `describe()` method of `pd.DataFrame`s to perform a set of aggregations that describe each group in the data:

In [23]:
display(songs.groupby('Year')['Other.releases'].describe())
display(songs.groupby('Year')[['Other.releases', 'Duration']].describe())

      count       mean        std   min   25%   50%   75%   max
Year
1958    2.0   0.000000   0.000000   0.0   0.0   0.0   0.0   0.0
1960    4.0   0.000000   0.000000   0.0   0.0   0.0   0.0   0.0
1961    3.0   7.333333   6.658328   0.0   4.5   9.0  11.0  13.0
1962   20.0   7.250000  15.870778   0.0   0.0   0.0   0.0  56.0
1963   66.0  10.045455  13.166895   0.0   0.0   0.0  20.5  45.0
1964   41.0  16.243902  10.570668   0.0   9.0  16.0  22.0  42.0
1965   37.0  13.162162   8.522889   0.0   9.0  12.0  18.0  34.0
1966   19.0  12.368421   6.576140   5.0   7.5  10.0  15.5  27.0
1967   27.0   9.629630   5.923539   0.0   6.0   8.0  13.0  25.0
1968   45.0   8.933333   6.358244   0.0   7.0   9.0  11.0  28.0
1969   43.0   7.883721   7.290598   0.0   0.0   7.0  12.0  28.0
1970    1.0  10.000000        NaN  10.0  10.0  10.0  10.0  10.0
1977    1.0   0.000000        NaN   0.0   0.0   0.0   0.0   0.0
1980    1.0   2.000000        NaN   2.0   2.0   2.0   2.0   2.0

     Other.releases                                                      \
              count       mean        std   min   25%   50%   75%   max
Year
1958            2.0   0.000000   0.000000   0.0   0.0   0.0   0.0   0.0
1960            4.0   0.000000   0.000000   0.0   0.0   0.0   0.0   0.0
1961            3.0   7.333333   6.658328   0.0   4.5   9.0  11.0  13.0
1962           20.0   7.250000  15.870778   0.0   0.0   0.0   0.0  56.0
1963           66.0  10.045455  13.166895   0.0   0.0   0.0  20.5  45.0
1964           41.0  16.243902  10.570668   0.0   9.0  16.0  22.0  42.0
1965           37.0  13.162162   8.522889   0.0   9.0  12.0  18.0  34.0
1966           19.0  12.368421   6.576140   5.0   7.5  10.0  15.5  27.0
1967           27.0   9.629630   5.923539   0.0   6.0   8.0  13.0  25.0
1968           45.0   8.933333   6.358244   0.0   7.0   9.0  11.0  28.0
1969           43.0   7.883721   7.290598   0.0   0.0   7.0  12.0  28.0
1970            1.0  10.000000        NaN  10.0  10.0  10.0  10.0  10.0
1977            1.0   0.000000        NaN   0.0   0.0   0.0   0.0   0.0
1980            1.0   2.000000        NaN   2.0   2.0   2.0   2.0   2.0

     Duration
        count        mean        std    min    25%    50%     75%    max
Year
1958      2.0  150.000000  19.798990  136.0  143.0  150.0  157.00  164.0
1960      4.0  136.750000  26.221810   98.0  132.5  147.0  151.25  155.0
1961      3.0  146.666667   5.773503  140.0  145.0  150.0  150.00  150.0
1962     20.0  140.900000  14.948684  105.0  127.5  150.0  150.00  156.0
1963     66.0  136.045455  22.645381   92.0  116.5  137.0  150.00  182.0
1964     41.0  144.048780  18.084456  106.0  130.0  145.0  155.00  183.0
1965     37.0  149.189189  18.255650  115.0  138.0  148.0  160.00  202.0
1966     19.0  157.473684  29.736563  121.0  136.5  157.0  178.50  245.0
1967     27.0  196.666667  68.833690   80.0  153.5  180.0  225.00  388.0
1968     45.0  194.511111  81.611224   52.0  148.0  183.0  226.00  502.0
1969     43.0  169.255814  73.975573   23.0  143.5  165.0  210.00  467.0
1970      1.0  145.000000        NaN  145.0  145.0  145.0  145.00  145.0
1977      1.0  266.000000        NaN  266.0  266.0  266.0  266.00  266.0
1980      1.0  236.000000        NaN  236.0  236.0  236.0  236.00  236.0

#### Aggregate, filter, transform, apply

`GroupBy` objects have `aggregate()`, `filter()`, `transform()`, and `apply()` methods that efficiently implement a variety of useful operations *before* combining the grouped data.

Read the dataset:

In [4]:
songs = pd.read_csv('data/The Beatles songs dataset, v2, no NAs.csv')

##### aggregate()
It can take a string, a function, or a list thereof, and compute all the aggregates at once. It can also take a dictionary specifying the aggregates to compute on specific columns:

In [13]:
display(songs.groupby('Year')[['Other.releases', 'Duration']].aggregate(['min', np.median]))
display(songs.groupby('Year')[['Other.releases', 'Duration']].aggregate({'Other.releases': 'median',
                                                                         'Duration': 'max'}))

     Other.releases        Duration
                min median      min median
Year
1958              0      0      136    150
1960              0      0       98    147
1961              0      9      140    150
1962              0      0      105    150
1963              0      0       92    137
1964              0     16      106    145
1965              0     12      115    148
1966              5     10      121    157
1967              0      8       80    180
1968              0      9       52    183
1969              0      7       23    165
1970             10     10      145    145
1977              0      0      266    266
1980              2      2      236    236

      Other.releases  Duration
Year
1958               0       164
1960               0       155
1961               9       150
1962               0       156
1963               0       182
1964              16       183
1965              12       202
1966              10       245
1967               8       388
1968               9       502
1969               7       467
1970              10       145
1977               0       266
1980               2       236

##### filter()
Drop groups based on a specific Boolean filter function.

In [18]:
def long_songs(x):
    return x['Duration'].max() > 500

display(songs.groupby('Year').filter(long_songs))

,Title,Year,Album.debut,Duration,Other.releases,Genre,Songwriter,Lead.vocal,Top.50.Billboard
5,Across the Universe,1968,Let It Be,230,19,"Psychedelic folk, Pop/Rock",Lennon,Lennon,-1
22,Back in the U.S.S.R.,1968,The Beatles,163,13,"Rock and Roll, Hard Rock, Pop/Rock",McCartney,McCartney,-1
29,Birthday,1968,The Beatles,162,11,"Hard Rock, Rock and Roll, Pop/Rock","McCartney, with Lennon","McCartney, with Lennon",-1
30,Blackbird,1968,The Beatles,139,12,"Folk, Pop/Rock",McCartney,McCartney,-1
40,Child of Nature,1968,Let It Be... Naked - Fly on the Wall bonus disc,254,0,"Soft Rock, Pop/Rock",Lennon,Lennon,-1
42,Circles,1968,NaN,226,0,"Hindustani Blues, Pop/Rock",Harrison,Harrison,-1
46,Cry Baby Cry,1968,The Beatles,183,10,Pop/Rock,Lennon,"Lennon, with McCartney",-1
50,Dear Prudence,1968,The Beatles,236,9,"Rock, Pop/Rock",Lennon,Lennon,-1
60,Don't Pass Me By,1968,The Beatles,231,11,"Country Rock, Pop/Rock",Starkey,Starkey,-1
64,Etcetera,1968,NaN,150,0,Pop/Rock,McCartney,McCartney,-1
66,Everybody's Got Something to Hide Except Me an...,1968,The Beatles,144,10,"Hard Rock, Pop/Rock",Lennon,Lennon,-1
80,Glass Onion,1968,The Beatles,137,8,"Psychedelic Rock, Pop/Rock",Lennon,Lennon,-1
84,Good Night,1968,The Beatles,191,8,"Orchestral Pop, Lullaby, Pop/Rock",Lennon,Starkey,-1
88,Happiness Is a Warm Gun,1968,The Beatles,163,7,Pop/Rock,Lennon,Lennon,-1
89,Heather,1968,NaN,130,0,"Rock, Pop/Rock",McCartney,McCartney,-1
93,Helter Skelter,1968,The Beatles,270,13,"Hard Rock, Heavy Metal[, Proto-Punk, Pop/Rock",McCartney,McCartney,-1
97,Hey Bulldog,1968,Yellow Submarine,194,12,"Psychedelic Rock, Hard Rock, Pop/Rock",Lennon,Lennon,-1
98,Hey Jude,1968,UK: 1967-1970 US: Hey Jude,431,28,"Rock, Pop/Rock",McCartney,McCartney,1
102,Honey Pie,1968,The Beatles,161,8,"Music Hall, Jazz, Ragtime, Pop/Rock",McCartney,McCartney,-1
121,I Will,1968,The Beatles,106,8,"Folk, Pop/Rock",McCartney,McCartney,-1
135,I'm So Tired,1968,The Beatles,123,11,"Blues Rock, Pop/Rock",Lennon,Lennon,-1
151,Julia,1968,The Beatles,174,10,"Folk, Pop/Rock",Lennon,Lennon,-1
152,Junk,1968,Anthology 3,114,0,"Folk, Pop/Rock",McCartney,McCartney,-1
156,Lady Madonna,1968,UK: 1967-1970 US: Hey Jude,136,21,"Rock and Roll, Pop/Rock","McCartney, with Lennon",McCartney,22
164,"Long, Long, Long",1968,The Beatles,184,6,"Psychedelic Folk, Pop/Rock",Harrison,Harrison,-1
176,Martha My Dear,1968,The Beatles,148,6,"Music Hall, Pop/Rock",McCartney,McCartney,-1
185,Mother Nature's Son,1968,The Beatles,168,10,"Folk, Pop/Rock",McCartney,McCartney,-1
191,Not Guilty,1968,Anthology 3,215,0,"Jazz-Pop, Pop/Rock",Harrison,Harrison,-1
194,"Ob-La-Di, Ob-La-Da",1968,The Beatles,187,16,"Ska, Pop/Rock",McCartney,McCartney,-1
205,Piggies,1968,The Beatles,124,9,"Baroque Pop, Folk, Pop/Rock",Harrison,Harrison,-1
211,Revolution 1,1968,The Beatles,201,7,"Hard rock, Pop/Rock",Lennon,Lennon,-1
212,Revolution 9,1968,The Beatles,502,7,"Avant-Garde, Musique Concrete, Experimental, S...","Lennon, with Ono and Harrison",NaN,-1
213,Revolution,1968,UK: 1967-1970 US: Hey Jude,201,23,"Hard rock, Pop/Rock",Lennon,Lennon,32
216,Rocky Raccoon,1968,The Beatles,213,9,"Country, Folk Rock, Pop/Rock","McCartney, with Lennon",McCartney,-1
219,Savoy Truffle,1968,The Beatles,174,7,"Soul, Blues Rock, Hard Rock, Pop/Rock",Harrison,Harrison,-1
222,Sexy Sadie,1968,The Beatles,195,11,Pop/Rock,Lennon,Lennon,-1
238,Sour Milk Sea,1968,NaN,236,0,"Hard Rock, Psychedelic Rock, Pop/Rock",Harrison,Harrison,-1
239,Step Inside Love/Los Paranoias,1968,Anthology 3,150,0,"Folk Rock, Pop/Rock","McCartney (Step Inside Love); Lennon, McCartne...",McCartney,-1
255,The Continuing Story of Bungalow Bill,1968,The Beatles,198,8,"Folk Rock, Pop/Rock",Lennon,"Lennon, with Starkey",-1
259,The Inner Light,1968,UK: Rarities US: Rarities,156,10,"Indian Music, Raga Rock, Pop/Rock",Harrison,Harrison,-1
283,What's The New Mary Jane,1968,Anthology 3,372,0,"Psychedelic Rock, Musique Concrete, Experiment...",Lennon,Lennon,-1
286,While My Guitar Gently Weeps,1968,The Beatles,286,18,"Rock, Psychedelic Rock, Blues Rock, Pop/Rock",Harrison,Harrison,-1
287,Why Don't We Do It in the Road?,1968,The Beatles,102,8,"Rock, Blues, Pop/Rock",McCartney,McCartney,-1
288,Wild Honey Pie,1968,The Beatles,52,7,"Experimental pop, Lo-Fi, Psychedelic Folk, Pop...",McCartney,McCartney,-1
295,Yer Blues,1968,The Beatles,241,11,"Blues Rock, Hard Rock, Pop/Rock",Lennon,Lennon,-1

##### transform()
Returns some transformed version of the full data (the output dataset has the same shape as the input dataset).

In [19]:
display(songs.groupby('Year')[['Other.releases', 'Duration']].transform(lambda x: max(x)))

     Other.releases  Duration
0                34       202
1                25       388
2                42       183
3                45       182
4                45       182
..              ...       ...
305              34       202
306              34       202
307              45       182
308              45       182
309              25       388

[310 rows x 2 columns]

##### apply()
Takes an arbitrary function and applies it to the group results.
The function should take a `pd.DataFrame` argument, and return either a Pandas object (e.g., `pd.DataFrame`, `pd.Series`) or a scalar. The combine operation will be tailored to the type of output returned.

In [21]:
def keep_a_few(x):
    return x[['Title', 'Year', 'Songwriter']]

display(songs.groupby('Year').apply(keep_a_few))

,Title,Year,Songwriter
0,12-Bar Original,1965,"Lennon, McCartney, Harrison and Starkey"
1,A Day in the Life,1967,Lennon and McCartney
2,A Hard Day's Night,1964,Lennon
3,A Shot of Rhythm and Blues,1963,Thompson
4,A Taste of Honey,1963,"Scott, Marlow"
...,...,...,...
305,You're Going to Lose That Girl,1965,Lennon
306,You've Got to Hide Your Love Away,1965,Lennon
307,You've Really Got a Hold on Me,1963,Robinson
308,Young Blood,1963,"Leiber, Stoller"
309,Your Mother Should Know,1967,McCartney

#### A list, array, series, or index providing the grouping keys
Specifying the grouping keys not as the values of a dataframe column, but in a different way.

##### List providing the grouping keys
The length of the list must be the same as the number of rows in the dataframe.

Generate len(songs.index) random numbers between 0 and 4, to simulate random grouping of the songs into 5 different playlists (based on [this](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html#A-list,-array,-series,-or-index-providing-the-grouping-keys); if in doubt about how it works, see [this](https://stackoverflow.com/questions/59402554/can-pandas-use-a-list-for-groupby)):

In [22]:
import random
print(len(songs.index))
random_index_list = np.random.choice(5, len(songs.index), replace=True)
print(random_index_list)

310
[4 1 4 1 3 1 4 1 1 1 1 3 1 3 3 4 2 2 3 4 0 0 3 0 4 4 0 0 3 2 4 4 0 0 0 1 3
 4 1 2 3 4 3 1 3 3 0 2 1 4 3 2 1 4 1 0 0 1 4 3 2 0 1 2 0 1 3 4 1 2 1 4 1 0
 3 2 1 4 1 2 3 4 1 3 1 1 1 3 0 3 1 2 1 1 1 4 2 4 1 2 4 0 3 3 0 4 0 0 0 2 2
 3 0 4 0 0 0 1 2 4 3 2 0 2 3 1 0 3 4 4 4 1 0 3 4 3 1 4 4 1 1 4 0 4 1 0 0 1
 4 4 0 0 2 4 3 4 4 1 0 0 3 3 2 2 0 3 3 2 3 0 3 0 3 0 1 0 0 3 4 2 3 4 1 0 1
 4 4 2 4 2 1 0 3 0 0 4 1 0 0 2 3 3 1 4 3 0 0 0 3 4 4 4 1 2 1 4 3 2 3 3 1 2
 3 2 0 0 3 1 0 4 4 2 4 1 3 4 3 2 4 4 4 2 4 1 0 0 1 3 1 0 2 1 0 4 1 2 0 1 3
 0 3 1 3 4 0 4 3 1 0 3 3 1 3 4 0 3 4 3 4 0 3 0 0 0 2 3 1 3 0 4 4 2 2 3 0 2
 3 3 4 2 3 3 1 0 0 2 3 0 0 4]

In [41]:
for i, playlist in songs.groupby(random_index_list):
    print(f'No. of songs in playlist {i + 1}: {len(playlist.index)}')
# for i, playlist in songs.groupby(random_index_list):
#     display(playlist.head())

No. of songs in playlist 1: 66
No. of songs in playlist 2: 68
No. of songs in playlist 3: 70
No. of songs in playlist 4: 63
No. of songs in playlist 5: 43

In the code snippet above, **<u>make sure to provide a tuple of indices for the `for` loop</u>**, the first one referring to the group index, and the second one representing the group itself.

##### A dictionary (or series) mapping index to group

Another method is to provide a dictionary that maps index values to the group keys.

Read the dataset and set the index to `Year`:

In [4]:
songs = pd.read_csv('data/The Beatles songs dataset, v2, no NAs.csv')
songs_by_year = songs.set_index(songs['Year'])
songs_by_year

,Title,Year,Album.debut,Duration,Other.releases,Genre,Songwriter,Lead.vocal,Top.50.Billboard
Year,,,,,,,,,
1965,12-Bar Original,1965,Anthology 2,174,0,Blues,"Lennon, McCartney, Harrison and Starkey",NaN,-1
1967,A Day in the Life,1967,Sgt. Pepper's Lonely Hearts Club Band,335,12,"Psychedelic Rock, Art Rock, Pop/Rock",Lennon and McCartney,Lennon and McCartney,-1
1964,A Hard Day's Night,1964,UK: A Hard Day's Night US: 1962-1966,152,35,"Rock, Electronic, Pop/Rock",Lennon,"Lennon, with McCartney",8
1963,A Shot of Rhythm and Blues,1963,Live at the BBC,104,0,"R&B, Pop/Rock",Thompson,Lennon,-1
1963,A Taste of Honey,1963,UK: Please Please Me US: The Early Beatles,163,29,"Pop/Rock, Jazz, Stage&Screen","Scott, Marlow",McCartney,-1
...,...,...,...,...,...,...,...,...,...
1965,You're Going to Lose That Girl,1965,Help!,140,6,"Rock, Pop/Rock",Lennon,Lennon,-1
1965,You've Got to Hide Your Love Away,1965,Help!,131,12,FolkPop/Rock,Lennon,Lennon,-1
1963,You've Really Got a Hold on Me,1963,UK: With the Beatles US: The Beatles Second Album,182,2,"Soul, Pop/Rock",Robinson,Lennon and Harrison,-1
1963,Young Blood,1963,Live at the BBC,116,0,Pop/Rock,"Leiber, Stoller",Harrison,-1
1967,Your Mother Should Know,1967,Magical Mystery Tour,149,13,"Music Hall, Vaudeville Rock, Psychedelic Pop, ...",McCartney,McCartney,-1

Create the mapping dictionary that splits the index in two halves:

In [8]:
mapping = {1958 : 'First half', 1960 : 'First half', 1961: 'First half', 
           1962: 'First half', 1963: 'First half', 1964: 'First half', 1965: 'First half', 
           1966: 'Second half', 1967: 'Second half', 1968: 'Second half', 1969: 'Second half', 1970: 'Second half', 
           1977: 'Second half', 1980: 'Second half'}

Group the songs:

In [10]:
display(songs_by_year.groupby(mapping).get_group('First half').head())
display(songs_by_year.groupby(mapping).get_group('Second half').head())

,Title,Year,Album.debut,Duration,Other.releases,Genre,Songwriter,Lead.vocal,Top.50.Billboard
Year,,,,,,,,,
1965,12-Bar Original,1965,Anthology 2,174,0,Blues,"Lennon, McCartney, Harrison and Starkey",NaN,-1
1964,A Hard Day's Night,1964,UK: A Hard Day's Night US: 1962-1966,152,35,"Rock, Electronic, Pop/Rock",Lennon,"Lennon, with McCartney",8
1963,A Shot of Rhythm and Blues,1963,Live at the BBC,104,0,"R&B, Pop/Rock",Thompson,Lennon,-1
1963,A Taste of Honey,1963,UK: Please Please Me US: The Early Beatles,163,29,"Pop/Rock, Jazz, Stage&Screen","Scott, Marlow",McCartney,-1
1965,Act Naturally,1965,UK: Help! US: Yesterday and Today,139,14,"Country, Pop/Rock","Russell, Morrison",Starkey,50

,Title,Year,Album.debut,Duration,Other.releases,Genre,Songwriter,Lead.vocal,Top.50.Billboard
Year,,,,,,,,,
1967,A Day in the Life,1967,Sgt. Pepper's Lonely Hearts Club Band,335,12,"Psychedelic Rock, Art Rock, Pop/Rock",Lennon and McCartney,Lennon and McCartney,-1
1968,Across the Universe,1968,Let It Be,230,19,"Psychedelic folk, Pop/Rock",Lennon,Lennon,-1
1969,All Things Must Pass,1969,Anthology 3,227,0,"Folk Rock, Pop/Rock",Harrison,Harrison,-1
1967,All Together Now,1967,Yellow Submarine,130,8,"Skiffle, Pop/Rock","McCartney, with Lennon","McCartney, with Lennon",-1
1967,All You Need Is Love,1967,Magical Mystery Tour,237,25,Pop/Rock,Lennon,Lennon,15

##### Any Python function defining the groups

Similar to mapping, one can pass any Python function that will input the index value and output the group:

In [14]:
def three_periods(x):
    if x < 1962:
        return 1
    elif x < 1971:
        return 2
    return 3

display(songs_by_year.groupby(three_periods).get_group(1).head())
display(songs_by_year.groupby(three_periods).get_group(2).head())
display(songs_by_year.groupby(three_periods).get_group(3).head())

,Title,Year,Album.debut,Duration,Other.releases,Genre,Songwriter,Lead.vocal,Top.50.Billboard
Year,,,,,,,,,
1961,Ain't She Sweet,1961,Anthology 1,150,9,Pop/Rock,"Yellen, Ager",Lennon,41
1960,Cayenne,1960,Anthology 1,144,0,"Instrumental Rock, Pop/Rock",McCartney,NaN,-1
1961,Cry for a Shadow,1961,Anthology 1,140,0,"Instrumental Rock, Pop/Rock",Lennon and Harrison,NaN,-1
1960,"Hallelujah, I Love Her So",1960,Anthology 1,155,0,"Blues, Jazz, R&B, Pop/Rock",Charles,McCartney,-1
1958,In Spite of All the Danger,1958,Anthology 1,164,0,"Skiffle, Blues, Rock and Roll, Pop/Rock",McCartney and Harrison,Lennon,-1

,Title,Year,Album.debut,Duration,Other.releases,Genre,Songwriter,Lead.vocal,Top.50.Billboard
Year,,,,,,,,,
1965,12-Bar Original,1965,Anthology 2,174,0,Blues,"Lennon, McCartney, Harrison and Starkey",NaN,-1
1967,A Day in the Life,1967,Sgt. Pepper's Lonely Hearts Club Band,335,12,"Psychedelic Rock, Art Rock, Pop/Rock",Lennon and McCartney,Lennon and McCartney,-1
1964,A Hard Day's Night,1964,UK: A Hard Day's Night US: 1962-1966,152,35,"Rock, Electronic, Pop/Rock",Lennon,"Lennon, with McCartney",8
1963,A Shot of Rhythm and Blues,1963,Live at the BBC,104,0,"R&B, Pop/Rock",Thompson,Lennon,-1
1963,A Taste of Honey,1963,UK: Please Please Me US: The Early Beatles,163,29,"Pop/Rock, Jazz, Stage&Screen","Scott, Marlow",McCartney,-1

,Title,Year,Album.debut,Duration,Other.releases,Genre,Songwriter,Lead.vocal,Top.50.Billboard
Year,,,,,,,,,
1977,Free as a Bird,1977,Anthology 1,266,0,"Rock, Pop/Rock","Lennon, with McCartney, Harrison and Starkey","Lennon, McCartney and Harrison",39
1980,Real Love,1980,Anthology 2,236,2,"Rock, Pop/Rock","Lennon, with McCartney, Harrison, Starkey",Lennon,47

##### Grouping on a multi-index
Any of the preceding key choices can be combined to group on a multi-index:

In [26]:
display(songs_by_year.groupby([random_index_list, mapping, ]).get_group((1, 'Second half')).head())

,Title,Year,Album.debut,Duration,Other.releases,Genre,Songwriter,Lead.vocal,Top.50.Billboard
Year,,,,,,,,,
1967,A Day in the Life,1967,Sgt. Pepper's Lonely Hearts Club Band,335,12,"Psychedelic Rock, Art Rock, Pop/Rock",Lennon and McCartney,Lennon and McCartney,-1
1968,Across the Universe,1968,Let It Be,230,19,"Psychedelic folk, Pop/Rock",Lennon,Lennon,-1
1969,All Things Must Pass,1969,Anthology 3,227,0,"Folk Rock, Pop/Rock",Harrison,Harrison,-1
1967,All You Need Is Love,1967,Magical Mystery Tour,237,25,Pop/Rock,Lennon,Lennon,15
1969,Dig a Pony,1969,Let It Be,232,12,"Blues Rock, Pop/Rock",Lennon,Lennon,-1

## Pivot tables
A pivot table takes simple column-wise data as input, and groups the entries into a two-dimensional table that provides a multidimensional summarization of the data. Think of pivot tables as essentially a multidimensional version of `GroupBy` aggregation. That is, you split-apply-combine, but both the split and the combine happen across not a one-dimensional index, but across a two-dimensional grid.

Read and extend the dataset:

In [34]:
songs = pd.read_csv('data/The Beatles songs dataset, v2, no NAs.csv')
songs['Career period'] = 'First half'
second_half = songs['Year'] > 1966
songs.loc[second_half, 'Career period'] = 'Second half'
display(songs.head())

,Title,Year,Album.debut,Duration,Other.releases,Genre,Songwriter,Lead.vocal,Top.50.Billboard,Career period
0,12-Bar Original,1965,Anthology 2,174,0,Blues,"Lennon, McCartney, Harrison and Starkey",NaN,-1,First half
1,A Day in the Life,1967,Sgt. Pepper's Lonely Hearts Club Band,335,12,"Psychedelic Rock, Art Rock, Pop/Rock",Lennon and McCartney,Lennon and McCartney,-1,Second half
2,A Hard Day's Night,1964,UK: A Hard Day's Night US: 1962-1966,152,35,"Rock, Electronic, Pop/Rock",Lennon,"Lennon, with McCartney",8,First half
3,A Shot of Rhythm and Blues,1963,Live at the BBC,104,0,"R&B, Pop/Rock",Thompson,Lennon,-1,First half
4,A Taste of Honey,1963,UK: Please Please Me US: The Early Beatles,163,29,"Pop/Rock, Jazz, Stage&Screen","Scott, Marlow",McCartney,-1,First half

Find the mean song duration by year, during the first and second halves of The Beatles career using `groupby()`:

In [40]:
songs.groupby(['Career period', 'Year', ])['Duration'].aggregate('mean').unstack()
# songs.groupby(['Career period', 'Year', ])[['Duration', 'Other.releases']].aggregate('mean').unstack()

Year,1958,1960,1961,1962,1963,1964,1965,1966,1967,1968,1969,1970,1977,1980
Career period,,,,,,,,,,,,,,
First half,150.0,136.75,146.666667,140.9,136.045455,144.04878,149.189189,157.473684,NaN,NaN,NaN,NaN,NaN,NaN
Second half,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,196.666667,194.511111,169.255814,145.0,266.0,236.0

### `pivot_table()`

Do the same as above using `pivot_table()`:

In [41]:
songs.pivot_table('Duration', index='Career period', columns='Year')

Year,1958,1960,1961,1962,1963,1964,1965,1966,1967,1968,1969,1970,1977,1980
Career period,,,,,,,,,,,,,,
First half,150.0,136.75,146.666667,140.9,136.045455,144.04878,149.189189,157.473684,NaN,NaN,NaN,NaN,NaN,NaN
Second half,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,196.666667,194.511111,169.255814,145.0,266.0,236.0

### Multi-level pivot tables

Just as in the ``GroupBy``, the grouping in pivot tables can be specified with multiple levels.

#### `pd.cut()`
Define bins for a range of values.<br>
Note that the bins are defined in the `(m, n]` way, i.e. the left value is not included in the bin, but the right on is.

Do the same as above, but introduce the third dimension: `Top.50.Billboard`. If `Top.50.Billboard` is -1, that's one bin (the song has not reached to Top 50); otherwise, it goes to the other bin.

In [48]:
top_50 = pd.cut(songs['Top.50.Billboard'], [-2, 0, 50])                           # -2, not -1, because of the (m, n] bins)
songs.pivot_table('Duration', index=['Career period', top_50], columns='Year')

Year                             1958    1960   1961        1962   1963  \
Career period Top.50.Billboard
First half    (-2, 0]           150.0  136.75  140.0  142.941176  136.0
              (0, 50]             NaN     NaN  150.0  129.333333  136.5
Second half   (-2, 0]             NaN     NaN    NaN         NaN    NaN
              (0, 50]             NaN     NaN    NaN         NaN    NaN

Year                                  1964        1965        1966     1967  \
Career period Top.50.Billboard
First half    (-2, 0]           142.096774  148.700000  151.166667      NaN
              (0, 50]           150.100000  151.285714  168.285714      NaN
Second half   (-2, 0]                  NaN         NaN         NaN  195.125
              (0, 50]                  NaN         NaN         NaN  209.000

Year                                  1968        1969   1970   1977   1980
Career period Top.50.Billboard
First half    (-2, 0]                  NaN         NaN    NaN    NaN    NaN
              (0, 50]                  NaN         NaN    NaN    NaN    NaN
Second half   (-2, 0]           190.119048  162.297297  145.0    NaN    NaN
              (0, 50]           256.000000  212.166667    NaN  266.0  236.0

#### `pd.qcut()`
Define bins for a range of values and compute quantiles automatically.

Add the fourth dimension to the above scenario - bins for `Other.releases` with automatically computed quantiles. Apply the same strategy as with `Top.50.Billboard`, this thme working with the columns:

In [53]:
other_releases = pd.qcut(songs['Other.releases'], 2)
display(other_releases)
songs.pivot_table('Duration', index=['Career period', top_50], columns=['Year', other_releases])
# songs.pivot_table('Duration', index=['Career period', top_50], columns=['Year', other_releases]).unstack()

0      (-0.001, 9.0]
1        (9.0, 56.0]
2        (9.0, 56.0]
3      (-0.001, 9.0]
4        (9.0, 56.0]
           ...
305    (-0.001, 9.0]
306      (9.0, 56.0]
307    (-0.001, 9.0]
308    (-0.001, 9.0]
309      (9.0, 56.0]
Name: Other.releases, Length: 310, dtype: category
Categories (2, interval[float64]): [(-0.001, 9.0] < (9.0, 56.0]]

Year                                    1958          1960          1961  \
Other.releases                 (-0.001, 9.0] (-0.001, 9.0] (-0.001, 9.0]
Career period Top.50.Billboard
First half    (-2, 0]                  150.0        136.75         140.0
              (0, 50]                    NaN           NaN         150.0
Second half   (-2, 0]                    NaN           NaN           NaN
              (0, 50]                    NaN           NaN           NaN

Year                                                1962              \
Other.releases                 (9.0, 56.0] (-0.001, 9.0] (9.0, 56.0]
Career period Top.50.Billboard
First half    (-2, 0]                  NaN       142.875  144.000000
              (0, 50]                150.0           NaN  129.333333
Second half   (-2, 0]                  NaN           NaN         NaN
              (0, 50]                  NaN           NaN         NaN

Year                                    1963                      1964  \
Other.releases                 (-0.001, 9.0] (9.0, 56.0] (-0.001, 9.0]
Career period Top.50.Billboard
First half    (-2, 0]             134.564103  138.666667    143.916667
              (0, 50]                    NaN  136.500000           NaN
Second half   (-2, 0]                    NaN         NaN           NaN
              (0, 50]                    NaN         NaN           NaN

Year                                        ...        1966          1967  \
Other.releases                 (9.0, 56.0]  ... (9.0, 56.0] (-0.001, 9.0]
Career period Top.50.Billboard              ...
First half    (-2, 0]           140.947368  ...  166.000000           NaN
              (0, 50]           150.100000  ...  171.833333           NaN
Second half   (-2, 0]                  NaN  ...         NaN    179.733333
              (0, 50]                  NaN  ...         NaN           NaN

Year                                                1968              \
Other.releases                 (9.0, 56.0] (-0.001, 9.0] (9.0, 56.0]
Career period Top.50.Billboard
First half    (-2, 0]                  NaN           NaN         NaN
              (0, 50]                  NaN           NaN         NaN
Second half   (-2, 0]           220.777778        189.56  190.941176
              (0, 50]           209.000000           NaN  256.000000

Year                                    1969                    1970  \
Other.releases                 (-0.001, 9.0] (9.0, 56.0] (9.0, 56.0]
Career period Top.50.Billboard
First half    (-2, 0]                    NaN         NaN         NaN
              (0, 50]                    NaN         NaN         NaN
Second half   (-2, 0]             156.444444  178.100000       145.0
              (0, 50]                    NaN  212.166667         NaN

Year                                    1977          1980
Other.releases                 (-0.001, 9.0] (-0.001, 9.0]
Career period Top.50.Billboard
First half    (-2, 0]                    NaN           NaN
              (0, 50]                    NaN           NaN
Second half   (-2, 0]                    NaN           NaN
              (0, 50]                  266.0         236.0

[4 rows x 23 columns]

### Additional pivot table options
The full call signature of the ``pivot_table`` method of ``DataFrame``s is as follows:

```python
# call signature as of Pandas 0.18
DataFrame.pivot_table(data, values=None, index=None, columns=None,
                      aggfunc='mean', fill_value=None, margins=False,
                      dropna=True, margins_name='All')
```

#### `aggfunc`
Specify an aggregation function other than mean. If aggregations are computed for multiple columns, these other functions can be different for different columns. Use a dictionary to specify all that.

In [54]:
# titanic.pivot_table(aggfunc={'survived': 'mean'}, index=['sex', age], columns=[fare, 'class'])
songs.pivot_table(aggfunc={'Duration': 'mean', 'Other.releases': 'median'}, index=['Career period', top_50], columns='Year')

                               Duration                                    \
Year                               1958    1960   1961        1962   1963
Career period Top.50.Billboard
First half    (-2, 0]             150.0  136.75  140.0  142.941176  136.0
              (0, 50]               NaN     NaN  150.0  129.333333  136.5
Second half   (-2, 0]               NaN     NaN    NaN         NaN    NaN
              (0, 50]               NaN     NaN    NaN         NaN    NaN

                                                                             \
Year                                  1964        1965        1966     1967
Career period Top.50.Billboard
First half    (-2, 0]           142.096774  148.700000  151.166667      NaN
              (0, 50]           150.100000  151.285714  168.285714      NaN
Second half   (-2, 0]                  NaN         NaN         NaN  195.125
              (0, 50]                  NaN         NaN         NaN  209.000

                                            ... Other.releases              \
Year                                  1968  ...           1963  1964  1965
Career period Top.50.Billboard              ...
First half    (-2, 0]                  NaN  ...            0.0  15.0  11.0
              (0, 50]                  NaN  ...           38.0  26.0  23.0
Second half   (-2, 0]           190.119048  ...            NaN   NaN   NaN
              (0, 50]           256.000000  ...            NaN   NaN   NaN


Year                            1966  1967  1968  1969  1970 1977 1980
Career period Top.50.Billboard
First half    (-2, 0]            8.5   NaN   NaN   NaN   NaN  NaN  NaN
              (0, 50]           20.0   NaN   NaN   NaN   NaN  NaN  NaN
Second half   (-2, 0]            NaN   7.0   8.0   6.0  10.0  NaN  NaN
              (0, 50]            NaN  14.0  23.0  17.5   NaN  0.0  2.0

[4 rows x 28 columns]

#### `margins`
Compute totals along each grouping.

In [61]:
display(songs.pivot_table('Duration', index='Career period', columns='Year', margins=True))
display(songs.pivot_table('Duration', index='Career period', columns='Year', margins=True, aggfunc='max'))

Year,1958,1960,1961,1962,1963,1964,1965,1966,1967,1968,1969,1970,1977,1980,All
Career period,,,,,,,,,,,,,,,
First half,150.0,136.75,146.666667,140.9,136.045455,144.04878,149.189189,157.473684,NaN,NaN,NaN,NaN,NaN,NaN,143.239583
Second half,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,196.666667,194.511111,169.255814,145.0,266.0,236.0,186.338983
All,150.0,136.75,146.666667,140.9,136.045455,144.04878,149.189189,157.473684,196.666667,194.511111,169.255814,145.0,266.0,236.0,159.645161

Year,1958,1960,1961,1962,1963,1964,1965,1966,1967,1968,1969,1970,1977,1980,All
Career period,,,,,,,,,,,,,,,
First half,164.0,155.0,150.0,156.0,182.0,183.0,202.0,245.0,NaN,NaN,NaN,NaN,NaN,NaN,245
Second half,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,388.0,502.0,467.0,145.0,266.0,236.0,502
All,164.0,155.0,150.0,156.0,182.0,183.0,202.0,245.0,388.0,502.0,467.0,145.0,266.0,236.0,502

## String operations in Pandas
Pandas vectorized string operations.

### Pandas vs. standard Python when working with strings

Looping through a list of strings with standard Python string operations breaks if there is a `None` (a missing value) in the list:

In [63]:
# This works well
names = ['john', 'Paul', 'GEORGE', 'rINGO']
[name.capitalize() for name in names]

# But this does not:
names = ['john', 'Paul', 'GEORGE', None, 'rINGO']
[name.capitalize() for name in names]

AttributeError: 'NoneType' object has no attribute 'capitalize'

### The `str` attribute of `pd.Series` and `pd.Index` objects containing strings

The above problem is easily eliminated with the `str` attribute of `pd.Series`:

In [2]:
names = ['john', 'Paul', 'GEORGE', None, 'rINGO']
display(names)

names = pd.Series(names)
display(names.str.capitalize())

['john', 'Paul', 'GEORGE', None, 'rINGO']

0      John
1      Paul
2    George
3      None
4     Ringo
dtype: object

#### `str` methods similar to Python string methods

Nearly all Python's built-in string methods are mirrored by a Pandas vectorized string method. Here is a list of Pandas ``str`` methods that mirror Python string methods:

|             |                  |                  |                  |
|-------------|------------------|------------------|------------------|
|``len()``    | ``lower()``      | ``translate()``  | ``islower()``    | 
|``ljust()``  | ``upper()``      | ``startswith()`` | ``isupper()``    | 
|``rjust()``  | ``find()``       | ``endswith()``   | ``isnumeric()``  | 
|``center()`` | ``rfind()``      | ``isalnum()``    | ``isdecimal()``  | 
|``zfill()``  | ``index()``      | ``isalpha()``    | ``split()``      | 
|``strip()``  | ``rindex()``     | ``isdigit()``    | ``rsplit()``     | 
|``rstrip()`` | ``capitalize()`` | ``isspace()``    | ``partition()``  | 
|``lstrip()`` |  ``swapcase()``  |  ``istitle()``   | ``rpartition()`` |

#### Miscelaneous `str` methods

There are other, miscellaneous methods that enable other convenient operations:

| Method | Description |
|--------|-------------|
| ``get()`` | Index each element |
| ``slice()`` | Slice each element|
| ``slice_replace()`` | Replace slice in each element with passed value|
| ``cat()``      | Concatenate strings|
| ``repeat()`` | Repeat values |
| ``normalize()`` | Return Unicode form of string |
| ``pad()`` | Add whitespace to left, right, or both sides of strings|
| ``wrap()`` | Split long strings into lines with length less than a given width|
| ``join()`` | Join strings in each element of the Series with passed separator|
| ``get_dummies()`` | extract dummy variables as a dataframe |

In [14]:
names = pd.Series(['John Lennon', 'Paul McCartney', 'George Harrison', 'Ringo Starr'])
display(names.str.split())
display(names.str.split().str.get(-1))

display(names.str.slice(0, 4))
display(names.str[0:4])

display(names.str.len().describe())                 # statistics about the length of The Beatles members' names
display(names[np.argmax(names.str.len())])          # Which member has the longest name?
display(names[names.str.contains('[Hh]arrison')])   # Which element contains the word 'Harrison' or 'harrison'?

0        [John, Lennon]
1     [Paul, McCartney]
2    [George, Harrison]
3        [Ringo, Starr]
dtype: object

0       Lennon
1    McCartney
2     Harrison
3        Starr
dtype: object

0    John
1    Paul
2    Geor
3    Ring
dtype: object

0    John
1    Paul
2    Geor
3    Ring
dtype: object

count     4.000000
mean     12.750000
std       2.061553
min      11.000000
25%      11.000000
50%      12.500000
75%      14.250000
max      15.000000
dtype: float64

'George Harrison'

2    George Harrison
dtype: object

## `eval()` and `query()` - high-performance Pandas

Used for faster computation, especially with large arrays. (YAGNI, but anyway...)

### `pd.eval()`
It's twice faster than ordinary array operations. The argument is supplied as a string.

In [19]:
nrows, ncols = 100000, 100
rng = np.random.RandomState(42)
df1, df2, df3, df4 = (pd.DataFrame(rng.rand(nrows, ncols))
                      for i in range(4))

%timeit df1 + df2 + df3 + df4
%timeit pd.eval('df1 + df2 + df3 + df4')                # the argument is supplied as a string

np.allclose(df1 + df2 + df3 + df4,                      # returns True if two arrays are element-wise equal within a tolerance
            pd.eval('df1 + df2 + df3 + df4'))

65.2 ms ± 617 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)
29 ms ± 191 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

True

`pd.eval()` supports all arithmetic, relational and logical operators. In all cases, the argument must be supplied as a string (i.e., as an expression to evaluate).

### `pd.DataFrame.eval()`
Allowes to access dataframe columns only by their names, instead of using the `df.<colname>` notation (required in case a dataframe column is accessed with `pd.eval()`). As with `pd.eval()`, the argument must be supplied as a string.

In [27]:
df = pd.DataFrame(rng.rand(1000, 3), columns=['A', 'B', 'C'])
display(df.head())

# With pd.eval()
result1 = (df['A'] + df['B']) / (df['C'] - 1)
result2 = pd.eval('(df.A + df.B) / (df.C - 1)')
display(np.allclose(result1, result2))

# With pd.DataFrame.eval()
result3 = df.eval('(A + B) / (C - 1)')
display(np.allclose(result1, result3))

df.eval('D = (A + B) / C', inplace=True)
display(df.head())

df.eval('D = (A - B) / C', inplace=True)
display(df.head())

# Combine column names with variable names
column_mean = df.mean(1)                               # ordinary Python variable
result1 = df['A'] + column_mean
result2 = df.eval('A + @column_mean')                  # @ is used to differentiate variable names from dataframe column names
np.allclose(result1, result2)                          # @ can be used only with pd.DataFrame.eval(), not with pd.eval()

          A         B         C
0  0.795161  0.181597  0.149695
1  0.203080  0.685920  0.492808
2  0.071043  0.391092  0.059148
3  0.154953  0.838043  0.226408
4  0.960107  0.596839  0.469705

True

True

          A         B         C         D
0  0.795161  0.181597  0.149695  6.524989
1  0.203080  0.685920  0.492808  1.803950
2  0.071043  0.391092  0.059148  7.813167
3  0.154953  0.838043  0.226408  4.385859
4  0.960107  0.596839  0.469705  3.314730

          A         B         C         D
0  0.795161  0.181597  0.149695  4.098765
1  0.203080  0.685920  0.492808 -0.979774
2  0.071043  0.391092  0.059148 -5.410975
3  0.154953  0.838043  0.226408 -3.017069
4  0.960107  0.596839  0.469705  0.773396

True

### pd.query()
Expressions like `pd.eval('df[(df.A < 0.5) & (df.B < 0.5)]')` cannot be used with `pd.DataFrame.eval()`, but `pd.query()` comes as a rescue:

In [29]:
result1 = df[(df.A < 0.5) & (df.B < 0.5)]
result2 = df.query('A < 0.5 and B < 0.5')
display(np.allclose(result1, result2))

True

Using variables in `pd.query()` is supported as well:

In [30]:
Cmean = df['C'].mean()
result1 = df[(df.A < Cmean) & (df.B < Cmean)]
result2 = df.query('A < @Cmean and B < @Cmean')
np.allclose(result1, result2)

True